/* automatically generated by rust-bindgen 0.71.1 */

pub const DUCKDB_TYPE_DUCKDB_TYPE_INVALID: DUCKDB_TYPE = 0;
pub const DUCKDB_TYPE_DUCKDB_TYPE_BOOLEAN: DUCKDB_TYPE = 1;
pub const DUCKDB_TYPE_DUCKDB_TYPE_TINYINT: DUCKDB_TYPE = 2;
pub const DUCKDB_TYPE_DUCKDB_TYPE_SMALLINT: DUCKDB_TYPE = 3;
pub const DUCKDB_TYPE_DUCKDB_TYPE_INTEGER: DUCKDB_TYPE = 4;
pub const DUCKDB_TYPE_DUCKDB_TYPE_BIGINT: DUCKDB_TYPE = 5;
pub const DUCKDB_TYPE_DUCKDB_TYPE_UTINYINT: DUCKDB_TYPE = 6;
pub const DUCKDB_TYPE_DUCKDB_TYPE_USMALLINT: DUCKDB_TYPE = 7;
pub const DUCKDB_TYPE_DUCKDB_TYPE_UINTEGER: DUCKDB_TYPE = 8;
pub const DUCKDB_TYPE_DUCKDB_TYPE_UBIGINT: DUCKDB_TYPE = 9;
pub const DUCKDB_TYPE_DUCKDB_TYPE_FLOAT: DUCKDB_TYPE = 10;
pub const DUCKDB_TYPE_DUCKDB_TYPE_DOUBLE: DUCKDB_TYPE = 11;
pub const DUCKDB_TYPE_DUCKDB_TYPE_TIMESTAMP: DUCKDB_TYPE = 12;
pub const DUCKDB_TYPE_DUCKDB_TYPE_DATE: DUCKDB_TYPE = 13;
pub const DUCKDB_TYPE_DUCKDB_TYPE_TIME: DUCKDB_TYPE = 14;
pub const DUCKDB_TYPE_DUCKDB_TYPE_INTERVAL: DUCKDB_TYPE = 15;
pub const DUCKDB_TYPE_DUCKDB_TYPE_HUGEINT: DUCKDB_TYPE = 16;
pub const DUCKDB_TYPE_DUCKDB_TYPE_UHUGEINT: DUCKDB_TYPE = 32;
pub const DUCKDB_TYPE_DUCKDB_TYPE_VARCHAR: DUCKDB_TYPE = 17;
pub const DUCKDB_TYPE_DUCKDB_TYPE_BLOB: DUCKDB_TYPE = 18;
pub const DUCKDB_TYPE_DUCKDB_TYPE_DECIMAL: DUCKDB_TYPE = 19;
pub const DUCKDB_TYPE_DUCKDB_TYPE_TIMESTAMP_S: DUCKDB_TYPE = 20;
pub const DUCKDB_TYPE_DUCKDB_TYPE_TIMESTAMP_MS: DUCKDB_TYPE = 21;

pub const duckdb_error_type_DUCKDB_ERROR_CONSTRAINT: duckdb_error_type = 18;
pub const duckdb_error_type_DUCKDB_ERROR_INDEX: duckdb_error_type = 19;
pub const duckdb_error_type_DUCKDB_ERROR_STAT: duckdb_error_type = 20;
pub const duckdb_error_type_DUCKDB_ERROR_CONNECTION: duckdb_error_type = 21;
pub const duckdb_error_type_DUCKDB_ERROR_SYNTAX: duckdb_error_type = 22;
pub const duckdb_error_type_DUCKDB_ERROR_SETTINGS: duckdb_error_type = 23;
pub const duckdb_error_type_DUCKDB_ERROR_BINDER: duckdb_error_type = 24;
pub const duckdb_error_type_DUCKDB_ERROR_NETWORK: duckdb_error_type = 25;
pub const duckdb_error_type_DUCKDB_ERROR_OPTIMIZER: duckdb_error_type = 26;
pub const duckdb_error_type_DUCKDB_ERROR_NULL_POINTER: duckdb_error_type = 27;
pub const duckdb_error_type_DUCKDB_ERROR_IO: duckdb_error_type = 28;
pub const duckdb_error_type_DUCKDB_ERROR_INTERRUPT: duckdb_error_type = 29;
pub const duckdb_error_type_DUCKDB_ERROR_FATAL: duckdb_error_type = 30;
pub const duckdb_error_type_DUCKDB_ERROR_INTERNAL: duckdb_error_type = 31;
pub const duckdb_error_type_DUCKDB_ERROR_INVALID_INPUT: duckdb_error_type = 32;
pub const duckdb_error_type_DUCKDB_ERROR_OUT_OF_MEMORY: duckdb_error_type = 33;
pub const duckdb_error_type_DUCKDB_ERROR_PERMISSION: duckdb_error_type = 34;
pub const duckdb_error_type_DUCKDB_ERROR_PARAMETER_NOT_RESOLVED: duckdb_error_type = 35;
pub const duckdb_error_type_DUCKDB_ERROR_PARAMETER_NOT_ALLOWED: duckdb_error_type = 36;
pub const duckdb_error_type_DUCKDB_ERROR_DEPENDENCY: duckdb_error_type = 37;
pub const duckdb_error_type_DUCKDB_ERROR_HTTP: duckdb_error_type = 38;
pub const duckdb_error_type_DUCKDB_ERROR_MISSING_EXTENSION: duckdb_error_type = 39;
pub const duckdb_error_type_DUCKDB_ERROR_AUTOLOAD: duckdb_error_type = 40;
pub const duckdb_error_type_DUCKDB_ERROR_SEQUENCE: duckdb_error_type = 41;
pub const duckdb_error_type_DUCKDB_INVALID_CONFIGURATION: duckdb_error_type = 42;
#[doc = "! An enum over DuckDB's different result types."]
pub type duckdb_error_type = ::std::os::raw::c_uint;
pub const duckdb_cast_mode_DUCKDB_CAST_NORMAL: duckdb_cast_mode = 0;
pub const duckdb_cast_mode_DUCKDB_CAST_TRY: duckdb_cast_mode = 1;
#[doc = "! An enum over DuckDB's different cast modes."]
pub type duckdb_cast_mode = ::std::os::raw::c_uint;
#[doc = "! DuckDB's index type."]
pub type idx_t = u64;
#[doc = "! The callback that will be called to destroy data, e.g.,\n! bind data (if any), init data (if any), extra data for replacement scans (if any)"]
pub type duckdb_delete_callback_t = ::std::option::Option<unsafe extern "C" fn(data: *mut ::std::os::raw::c_void)>;
#[doc = "! Used for threading, contains a task state. Must be destroyed with `duckdb_destroy_state`."]
pub type duckdb_task_state = *mut ::std::os::raw::c_void;
#[doc = "! Days are stored as days since 1970-01-01\n! Use the duckdb_from_date/duckdb_to_date function to extract individual information"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_date {
    pub days: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_date"][::std::mem::size_of::<duckdb_date>() - 4usize];
    ["Alignment of duckdb_date"][::std::mem::align_of::<duckdb_date>() - 4usize];
    ["Offset of field: duckdb_date::days"][::std::mem::offset_of!(duckdb_date, days) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_date_struct {
    pub year: i32,
    pub month: i8,
    pub day: i8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_date_struct"][::std::mem::size_of::<duckdb_date_struct>() - 8usize];
    ["Alignment of duckdb_date_struct"][::std::mem::align_of::<duckdb_date_struct>() - 4usize];
    ["Offset of field: duckdb_date_struct::year"][::std::mem::offset_of!(duckdb_date_struct, year) - 0usize];
    ["Offset of field: duckdb_date_struct::month"][::std::mem::offset_of!(duckdb_date_struct, month) - 4usize];
    ["Offset of field: duckdb_date_struct::day"][::std::mem::offset_of!(duckdb_date_struct, day) - 5usize];
};
#[doc = "! Time is stored as microseconds since 00:00:00\n! Use the duckdb_from_time/duckdb_to_time function to extract individual information"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_time {
    pub micros: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_time"][::std::mem::size_of::<duckdb_time>() - 8usize];
    ["Alignment of duckdb_time"][::std::mem::align_of::<duckdb_time>() - 8usize];
    ["Offset of field: duckdb_time::micros"][::std::mem::offset_of!(duckdb_time, micros) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_time_struct {
    pub hour: i8,
    pub min: i8,
    pub sec: i8,
    pub micros: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_time_struct"][::std::mem::size_of::<duckdb_time_struct>() - 8usize];
    ["Alignment of duckdb_time_struct"][::std::mem::align_of::<duckdb_time_struct>() - 4usize];
    ["Offset of field: duckdb_time_struct::hour"][::std::mem::offset_of!(duckdb_time_struct, hour) - 0usize];
    ["Offset of field: duckdb_time_struct::min"][::std::mem::offset_of!(duckdb_time_struct, min) - 1usize];
    ["Offset of field: duckdb_time_struct::sec"][::std::mem::offset_of!(duckdb_time_struct, sec) - 2usize];
    ["Offset of field: duckdb_time_struct::micros"][::std::mem::offset_of!(duckdb_time_struct, micros) - 4usize];
};
#[doc = "! TIME_TZ is stored as 40 bits for int64_t micros, and 24 bits for int32_t offset"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_time_tz {
    pub bits: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_time_tz"][::std::mem::size_of::<duckdb_time_tz>() - 8usize];
    ["Alignment of duckdb_time_tz"][::std::mem::align_of::<duckdb_time_tz>() - 8usize];
    ["Offset of field: duckdb_time_tz::bits"][::std::mem::offset_of!(duckdb_time_tz, bits) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_time_tz_struct {
    pub time: duckdb_time_struct,
    pub offset: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_time_tz_struct"][::std::mem::size_of::<duckdb_time_tz_struct>() - 12usize];
    ["Alignment of duckdb_time_tz_struct"][::std::mem::align_of::<duckdb_time_tz_struct>() - 4usize];
    ["Offset of field: duckdb_time_tz_struct::time"][::std::mem::offset_of!(duckdb_time_tz_struct, time) - 0usize];
    ["Offset of field: duckdb_time_tz_struct::offset"][::std::mem::offset_of!(duckdb_time_tz_struct, offset) - 8usize];
};
#[doc = "! TIMESTAMP values are stored as microseconds since 1970-01-01.\n! Use the duckdb_from_timestamp and duckdb_to_timestamp functions to extract individual information."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_timestamp {
    pub micros: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_timestamp"][::std::mem::size_of::<duckdb_timestamp>() - 8usize];
    ["Alignment of duckdb_timestamp"][::std::mem::align_of::<duckdb_timestamp>() - 8usize];
    ["Offset of field: duckdb_timestamp::micros"][::std::mem::offset_of!(duckdb_timestamp, micros) - 0usize];
};
#[doc = "! TIMESTAMP_S values are stored as seconds since 1970-01-01."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_timestamp_s {
    pub seconds: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_timestamp_s"][::std::mem::size_of::<duckdb_timestamp_s>() - 8usize];
    ["Alignment of duckdb_timestamp_s"][::std::mem::align_of::<duckdb_timestamp_s>() - 8usize];
    ["Offset of field: duckdb_timestamp_s::seconds"][::std::mem::offset_of!(duckdb_timestamp_s, seconds) - 0usize];
};
#[doc = "! TIMESTAMP_MS values are stored as milliseconds since 1970-01-01."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_timestamp_ms {
    pub millis: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_timestamp_ms"][::std::mem::size_of::<duckdb_timestamp_ms>() - 8usize];
    ["Alignment of duckdb_timestamp_ms"][::std::mem::align_of::<duckdb_timestamp_ms>() - 8usize];
    ["Offset of field: duckdb_timestamp_ms::millis"][::std::mem::offset_of!(duckdb_timestamp_ms, millis) - 0usize];
};
#[doc = "! TIMESTAMP_NS values are stored as nanoseconds since 1970-01-01."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_timestamp_ns {
    pub nanos: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_timestamp_ns"][::std::mem::size_of::<duckdb_timestamp_ns>() - 8usize];
    ["Alignment of duckdb_timestamp_ns"][::std::mem::align_of::<duckdb_timestamp_ns>() - 8usize];
    ["Offset of field: duckdb_timestamp_ns::nanos"][::std::mem::offset_of!(duckdb_timestamp_ns, nanos) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_timestamp_struct {
    pub date: duckdb_date_struct,
    pub time: duckdb_time_struct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_timestamp_struct"][::std::mem::size_of::<duckdb_timestamp_struct>() - 16usize];
    ["Alignment of duckdb_timestamp_struct"][::std::mem::align_of::<duckdb_timestamp_struct>() - 4usize];
    ["Offset of field: duckdb_timestamp_struct::date"][::std::mem::offset_of!(duckdb_timestamp_struct, date) - 0usize];
    ["Offset of field: duckdb_timestamp_struct::time"][::std::mem::offset_of!(duckdb_timestamp_struct, time) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_interval {
    pub months: i32,
    pub days: i32,
    pub micros: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_interval"][::std::mem::size_of::<duckdb_interval>() - 16usize];
    ["Alignment of duckdb_interval"][::std::mem::align_of::<duckdb_interval>() - 8usize];
    ["Offset of field: duckdb_interval::months"][::std::mem::offset_of!(duckdb_interval, months) - 0usize];
    ["Offset of field: duckdb_interval::days"][::std::mem::offset_of!(duckdb_interval, days) - 4usize];
    ["Offset of field: duckdb_interval::micros"][::std::mem::offset_of!(duckdb_interval, micros) - 8usize];
};
#[doc = "! Hugeints are composed of a (lower, upper) component\n! The value of the hugeint is upper * 2^64 + lower\n! For easy usage, the functions duckdb_hugeint_to_double/duckdb_double_to_hugeint are recommended"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_hugeint {
    pub lower: u64,
    pub upper: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_hugeint"][::std::mem::size_of::<duckdb_hugeint>() - 16usize];
    ["Alignment of duckdb_hugeint"][::std::mem::align_of::<duckdb_hugeint>() - 8usize];
    ["Offset of field: duckdb_hugeint::lower"][::std::mem::offset_of!(duckdb_hugeint, lower) - 0usize];
    ["Offset of field: duckdb_hugeint::upper"][::std::mem::offset_of!(duckdb_hugeint, upper) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_uhugeint {
    pub lower: u64,
    pub upper: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_uhugeint"][::std::mem::size_of::<duckdb_uhugeint>() - 16usize];
    ["Alignment of duckdb_uhugeint"][::std::mem::align_of::<duckdb_uhugeint>() - 8usize];
    ["Offset of field: duckdb_uhugeint::lower"][::std::mem::offset_of!(duckdb_uhugeint, lower) - 0usize];
    ["Offset of field: duckdb_uhugeint::upper"][::std::mem::offset_of!(duckdb_uhugeint, upper) - 8usize];
};
#[doc = "! Decimals are composed of a width and a scale, and are stored in a hugeint"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_decimal {
    pub width: u8,
    pub scale: u8,
    pub value: duckdb_hugeint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_decimal"][::std::mem::size_of::<duckdb_decimal>() - 24usize];
    ["Alignment of duckdb_decimal"][::std::mem::align_of::<duckdb_decimal>() - 8usize];
    ["Offset of field: duckdb_decimal::width"][::std::mem::offset_of!(duckdb_decimal, width) - 0usize];
    ["Offset of field: duckdb_decimal::scale"][::std::mem::offset_of!(duckdb_decimal, scale) - 1usize];
    ["Offset of field: duckdb_decimal::value"][::std::mem::offset_of!(duckdb_decimal, value) - 8usize];
};
#[doc = "! A type holding information about the query execution progress"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_query_progress_type {
    pub percentage: f64,
    pub rows_processed: u64,
    pub total_rows_to_process: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_query_progress_type"][::std::mem::size_of::<duckdb_query_progress_type>() - 24usize];
    ["Alignment of duckdb_query_progress_type"][::std::mem::align_of::<duckdb_query_progress_type>() - 8usize];
    ["Offset of field: duckdb_query_progress_type::percentage"]
        [::std::mem::offset_of!(duckdb_query_progress_type, percentage) - 0usize];
    ["Offset of field: duckdb_query_progress_type::rows_processed"]
        [::std::mem::offset_of!(duckdb_query_progress_type, rows_processed) - 8usize];
    ["Offset of field: duckdb_query_progress_type::total_rows_to_process"]
        [::std::mem::offset_of!(duckdb_query_progress_type, total_rows_to_process) - 16usize];
};
#[doc = "! The internal representation of a VARCHAR (string_t). If the VARCHAR does not\n! exceed 12 characters, then we inline it. Otherwise, we inline a prefix for faster\n! string comparisons and store a pointer to the remaining characters. This is a non-\n! owning structure, i.e., it does not have to be freed."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct duckdb_string_t {
    pub value: duckdb_string_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union duckdb_string_t__bindgen_ty_1 {
    pub pointer: duckdb_string_t__bindgen_ty_1__bindgen_ty_1,
    pub inlined: duckdb_string_t__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_string_t__bindgen_ty_1__bindgen_ty_1 {
    pub length: u32,
    pub prefix: [::std::os::raw::c_char; 4usize],
    pub ptr: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_string_t__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<duckdb_string_t__bindgen_ty_1__bindgen_ty_1>() - 16usize];
    ["Alignment of duckdb_string_t__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<duckdb_string_t__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: duckdb_string_t__bindgen_ty_1__bindgen_ty_1::length"]
        [::std::mem::offset_of!(duckdb_string_t__bindgen_ty_1__bindgen_ty_1, length) - 0usize];
    ["Offset of field: duckdb_string_t__bindgen_ty_1__bindgen_ty_1::prefix"]
        [::std::mem::offset_of!(duckdb_string_t__bindgen_ty_1__bindgen_ty_1, prefix) - 4usize];
    ["Offset of field: duckdb_string_t__bindgen_ty_1__bindgen_ty_1::ptr"]
        [::std::mem::offset_of!(duckdb_string_t__bindgen_ty_1__bindgen_ty_1, ptr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_string_t__bindgen_ty_1__bindgen_ty_2 {
    pub length: u32,
    pub inlined: [::std::os::raw::c_char; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_string_t__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<duckdb_string_t__bindgen_ty_1__bindgen_ty_2>() - 16usize];
    ["Alignment of duckdb_string_t__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<duckdb_string_t__bindgen_ty_1__bindgen_ty_2>() - 4usize];
    ["Offset of field: duckdb_string_t__bindgen_ty_1__bindgen_ty_2::length"]
        [::std::mem::offset_of!(duckdb_string_t__bindgen_ty_1__bindgen_ty_2, length) - 0usize];
    ["Offset of field: duckdb_string_t__bindgen_ty_1__bindgen_ty_2::inlined"]
        [::std::mem::offset_of!(duckdb_string_t__bindgen_ty_1__bindgen_ty_2, inlined) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_string_t__bindgen_ty_1"][::std::mem::size_of::<duckdb_string_t__bindgen_ty_1>() - 16usize];
    ["Alignment of duckdb_string_t__bindgen_ty_1"][::std::mem::align_of::<duckdb_string_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: duckdb_string_t__bindgen_ty_1::pointer"]
        [::std::mem::offset_of!(duckdb_string_t__bindgen_ty_1, pointer) - 0usize];
    ["Offset of field: duckdb_string_t__bindgen_ty_1::inlined"]
        [::std::mem::offset_of!(duckdb_string_t__bindgen_ty_1, inlined) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_string_t"][::std::mem::size_of::<duckdb_string_t>() - 16usize];
    ["Alignment of duckdb_string_t"][::std::mem::align_of::<duckdb_string_t>() - 8usize];
    ["Offset of field: duckdb_string_t::value"][::std::mem::offset_of!(duckdb_string_t, value) - 0usize];
};
#[doc = "! The internal representation of a list metadata entry contains the list's offset in\n! the child vector, and its length. The parent vector holds these metadata entries,\n! whereas the child vector holds the data"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_list_entry {
    pub offset: u64,
    pub length: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_list_entry"][::std::mem::size_of::<duckdb_list_entry>() - 16usize];
    ["Alignment of duckdb_list_entry"][::std::mem::align_of::<duckdb_list_entry>() - 8usize];
    ["Offset of field: duckdb_list_entry::offset"][::std::mem::offset_of!(duckdb_list_entry, offset) - 0usize];
    ["Offset of field: duckdb_list_entry::length"][::std::mem::offset_of!(duckdb_list_entry, length) - 8usize];
};
#[doc = "! A column consists of a pointer to its internal data. Don't operate on this type directly.\n! Instead, use functions such as duckdb_column_data, duckdb_nullmask_data,\n! duckdb_column_type, and duckdb_column_name, which take the result and the column index\n! as their parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_column {
    pub deprecated_data: *mut ::std::os::raw::c_void,
    pub deprecated_nullmask: *mut bool,
    pub deprecated_type: duckdb_type,
    pub deprecated_name: *mut ::std::os::raw::c_char,
    pub internal_data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_column"][::std::mem::size_of::<duckdb_column>() - 40usize];
    ["Alignment of duckdb_column"][::std::mem::align_of::<duckdb_column>() - 8usize];
    ["Offset of field: duckdb_column::deprecated_data"]
        [::std::mem::offset_of!(duckdb_column, deprecated_data) - 0usize];
    ["Offset of field: duckdb_column::deprecated_nullmask"]
        [::std::mem::offset_of!(duckdb_column, deprecated_nullmask) - 8usize];
    ["Offset of field: duckdb_column::deprecated_type"]
        [::std::mem::offset_of!(duckdb_column, deprecated_type) - 16usize];
    ["Offset of field: duckdb_column::deprecated_name"]
        [::std::mem::offset_of!(duckdb_column, deprecated_name) - 24usize];
    ["Offset of field: duckdb_column::internal_data"][::std::mem::offset_of!(duckdb_column, internal_data) - 32usize];
};
#[doc = "! A vector to a specified column in a data chunk. Lives as long as the\n! data chunk lives, i.e., must not be destroyed."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_vector {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_vector"][::std::mem::size_of::<_duckdb_vector>() - 8usize];
    ["Alignment of _duckdb_vector"][::std::mem::align_of::<_duckdb_vector>() - 8usize];
    ["Offset of field: _duckdb_vector::internal_ptr"][::std::mem::offset_of!(_duckdb_vector, internal_ptr) - 0usize];
};
#[doc = "! A vector to a specified column in a data chunk. Lives as long as the\n! data chunk lives, i.e., must not be destroyed."]
pub type duckdb_vector = *mut _duckdb_vector;
#[doc = "! Strings are composed of a char pointer and a size. You must free string.data\n! with `duckdb_free`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_string {
    pub data: *mut ::std::os::raw::c_char,
    pub size: idx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_string"][::std::mem::size_of::<duckdb_string>() - 16usize];
    ["Alignment of duckdb_string"][::std::mem::align_of::<duckdb_string>() - 8usize];
    ["Offset of field: duckdb_string::data"][::std::mem::offset_of!(duckdb_string, data) - 0usize];
    ["Offset of field: duckdb_string::size"][::std::mem::offset_of!(duckdb_string, size) - 8usize];
};
#[doc = "! BLOBs are composed of a byte pointer and a size. You must free blob.data\n! with `duckdb_free`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_blob {
    pub data: *mut ::std::os::raw::c_void,
    pub size: idx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_blob"][::std::mem::size_of::<duckdb_blob>() - 16usize];
    ["Alignment of duckdb_blob"][::std::mem::align_of::<duckdb_blob>() - 8usize];
    ["Offset of field: duckdb_blob::data"][::std::mem::offset_of!(duckdb_blob, data) - 0usize];
    ["Offset of field: duckdb_blob::size"][::std::mem::offset_of!(duckdb_blob, size) - 8usize];
};
#[doc = "! BITs are composed of a byte pointer and a size.\n! BIT byte data has 0 to 7 bits of padding.\n! The first byte contains the number of padding bits.\n! This number of bits of the second byte are set to 1, starting from the MSB.\n! You must free `data` with `duckdb_free`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_bit {
    pub data: *mut u8,
    pub size: idx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_bit"][::std::mem::size_of::<duckdb_bit>() - 16usize];
    ["Alignment of duckdb_bit"][::std::mem::align_of::<duckdb_bit>() - 8usize];
    ["Offset of field: duckdb_bit::data"][::std::mem::offset_of!(duckdb_bit, data) - 0usize];
    ["Offset of field: duckdb_bit::size"][::std::mem::offset_of!(duckdb_bit, size) - 8usize];
};
#[doc = "! VARINTs are composed of a byte pointer, a size, and an is_negative bool.\n! The absolute value of the number is stored in `data` in little endian format.\n! You must free `data` with `duckdb_free`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_varint {
    pub data: *mut u8,
    pub size: idx_t,
    pub is_negative: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_varint"][::std::mem::size_of::<duckdb_varint>() - 24usize];
    ["Alignment of duckdb_varint"][::std::mem::align_of::<duckdb_varint>() - 8usize];
    ["Offset of field: duckdb_varint::data"][::std::mem::offset_of!(duckdb_varint, data) - 0usize];
    ["Offset of field: duckdb_varint::size"][::std::mem::offset_of!(duckdb_varint, size) - 8usize];
    ["Offset of field: duckdb_varint::is_negative"][::std::mem::offset_of!(duckdb_varint, is_negative) - 16usize];
};
#[doc = "! A query result consists of a pointer to its internal data.\n! Must be freed with 'duckdb_destroy_result'."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_result {
    pub deprecated_column_count: idx_t,
    pub deprecated_row_count: idx_t,
    pub deprecated_rows_changed: idx_t,
    pub deprecated_columns: *mut duckdb_column,
    pub deprecated_error_message: *mut ::std::os::raw::c_char,
    pub internal_data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_result"][::std::mem::size_of::<duckdb_result>() - 48usize];
    ["Alignment of duckdb_result"][::std::mem::align_of::<duckdb_result>() - 8usize];
    ["Offset of field: duckdb_result::deprecated_column_count"]
        [::std::mem::offset_of!(duckdb_result, deprecated_column_count) - 0usize];
    ["Offset of field: duckdb_result::deprecated_row_count"]
        [::std::mem::offset_of!(duckdb_result, deprecated_row_count) - 8usize];
    ["Offset of field: duckdb_result::deprecated_rows_changed"]
        [::std::mem::offset_of!(duckdb_result, deprecated_rows_changed) - 16usize];
    ["Offset of field: duckdb_result::deprecated_columns"]
        [::std::mem::offset_of!(duckdb_result, deprecated_columns) - 24usize];
    ["Offset of field: duckdb_result::deprecated_error_message"]
        [::std::mem::offset_of!(duckdb_result, deprecated_error_message) - 32usize];
    ["Offset of field: duckdb_result::internal_data"][::std::mem::offset_of!(duckdb_result, internal_data) - 40usize];
};
#[doc = "! A database instance cache object. Must be destroyed with `duckdb_destroy_instance_cache`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_instance_cache {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_instance_cache"][::std::mem::size_of::<_duckdb_instance_cache>() - 8usize];
    ["Alignment of _duckdb_instance_cache"][::std::mem::align_of::<_duckdb_instance_cache>() - 8usize];
    ["Offset of field: _duckdb_instance_cache::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_instance_cache, internal_ptr) - 0usize];
};
#[doc = "! A database instance cache object. Must be destroyed with `duckdb_destroy_instance_cache`."]
pub type duckdb_instance_cache = *mut _duckdb_instance_cache;
#[doc = "! A database object. Must be closed with `duckdb_close`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_database {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_database"][::std::mem::size_of::<_duckdb_database>() - 8usize];
    ["Alignment of _duckdb_database"][::std::mem::align_of::<_duckdb_database>() - 8usize];
    ["Offset of field: _duckdb_database::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_database, internal_ptr) - 0usize];
};
#[doc = "! A database object. Must be closed with `duckdb_close`."]
pub type duckdb_database = *mut _duckdb_database;
#[doc = "! A connection to a duckdb database. Must be closed with `duckdb_disconnect`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_connection {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_connection"][::std::mem::size_of::<_duckdb_connection>() - 8usize];
    ["Alignment of _duckdb_connection"][::std::mem::align_of::<_duckdb_connection>() - 8usize];
    ["Offset of field: _duckdb_connection::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_connection, internal_ptr) - 0usize];
};
#[doc = "! A connection to a duckdb database. Must be closed with `duckdb_disconnect`."]
pub type duckdb_connection = *mut _duckdb_connection;
#[doc = "! A prepared statement is a parameterized query that allows you to bind parameters to it.\n! Must be destroyed with `duckdb_destroy_prepare`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_prepared_statement {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_prepared_statement"][::std::mem::size_of::<_duckdb_prepared_statement>() - 8usize];
    ["Alignment of _duckdb_prepared_statement"][::std::mem::align_of::<_duckdb_prepared_statement>() - 8usize];
    ["Offset of field: _duckdb_prepared_statement::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_prepared_statement, internal_ptr) - 0usize];
};
#[doc = "! A prepared statement is a parameterized query that allows you to bind parameters to it.\n! Must be destroyed with `duckdb_destroy_prepare`."]
pub type duckdb_prepared_statement = *mut _duckdb_prepared_statement;
#[doc = "! Extracted statements. Must be destroyed with `duckdb_destroy_extracted`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_extracted_statements {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_extracted_statements"][::std::mem::size_of::<_duckdb_extracted_statements>() - 8usize];
    ["Alignment of _duckdb_extracted_statements"][::std::mem::align_of::<_duckdb_extracted_statements>() - 8usize];
    ["Offset of field: _duckdb_extracted_statements::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_extracted_statements, internal_ptr) - 0usize];
};
#[doc = "! Extracted statements. Must be destroyed with `duckdb_destroy_extracted`."]
pub type duckdb_extracted_statements = *mut _duckdb_extracted_statements;
#[doc = "! The pending result represents an intermediate structure for a query that is not yet fully executed.\n! Must be destroyed with `duckdb_destroy_pending`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_pending_result {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_pending_result"][::std::mem::size_of::<_duckdb_pending_result>() - 8usize];
    ["Alignment of _duckdb_pending_result"][::std::mem::align_of::<_duckdb_pending_result>() - 8usize];
    ["Offset of field: _duckdb_pending_result::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_pending_result, internal_ptr) - 0usize];
};
#[doc = "! The pending result represents an intermediate structure for a query that is not yet fully executed.\n! Must be destroyed with `duckdb_destroy_pending`."]
pub type duckdb_pending_result = *mut _duckdb_pending_result;
#[doc = "! The appender enables fast data loading into DuckDB.\n! Must be destroyed with `duckdb_appender_destroy`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_appender {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_appender"][::std::mem::size_of::<_duckdb_appender>() - 8usize];
    ["Alignment of _duckdb_appender"][::std::mem::align_of::<_duckdb_appender>() - 8usize];
    ["Offset of field: _duckdb_appender::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_appender, internal_ptr) - 0usize];
};
#[doc = "! The appender enables fast data loading into DuckDB.\n! Must be destroyed with `duckdb_appender_destroy`."]
pub type duckdb_appender = *mut _duckdb_appender;
#[doc = "! The table description allows querying info about the table.\n! Must be destroyed with `duckdb_table_description_destroy`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_table_description {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_table_description"][::std::mem::size_of::<_duckdb_table_description>() - 8usize];
    ["Alignment of _duckdb_table_description"][::std::mem::align_of::<_duckdb_table_description>() - 8usize];
    ["Offset of field: _duckdb_table_description::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_table_description, internal_ptr) - 0usize];
};
#[doc = "! The table description allows querying info about the table.\n! Must be destroyed with `duckdb_table_description_destroy`."]
pub type duckdb_table_description = *mut _duckdb_table_description;
#[doc = "! Can be used to provide start-up options for the DuckDB instance.\n! Must be destroyed with `duckdb_destroy_config`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_config {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_config"][::std::mem::size_of::<_duckdb_config>() - 8usize];
    ["Alignment of _duckdb_config"][::std::mem::align_of::<_duckdb_config>() - 8usize];
    ["Offset of field: _duckdb_config::internal_ptr"][::std::mem::offset_of!(_duckdb_config, internal_ptr) - 0usize];
};
#[doc = "! Can be used to provide start-up options for the DuckDB instance.\n! Must be destroyed with `duckdb_destroy_config`."]
pub type duckdb_config = *mut _duckdb_config;
#[doc = "! Holds an internal logical type.\n! Must be destroyed with `duckdb_destroy_logical_type`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_logical_type {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_logical_type"][::std::mem::size_of::<_duckdb_logical_type>() - 8usize];
    ["Alignment of _duckdb_logical_type"][::std::mem::align_of::<_duckdb_logical_type>() - 8usize];
    ["Offset of field: _duckdb_logical_type::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_logical_type, internal_ptr) - 0usize];
};
#[doc = "! Holds an internal logical type.\n! Must be destroyed with `duckdb_destroy_logical_type`."]
pub type duckdb_logical_type = *mut _duckdb_logical_type;
#[doc = "! Holds extra information used when registering a custom logical type.\n! Reserved for future use."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_create_type_info {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_create_type_info"][::std::mem::size_of::<_duckdb_create_type_info>() - 8usize];
    ["Alignment of _duckdb_create_type_info"][::std::mem::align_of::<_duckdb_create_type_info>() - 8usize];
    ["Offset of field: _duckdb_create_type_info::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_create_type_info, internal_ptr) - 0usize];
};
#[doc = "! Holds extra information used when registering a custom logical type.\n! Reserved for future use."]
pub type duckdb_create_type_info = *mut _duckdb_create_type_info;
#[doc = "! Contains a data chunk from a duckdb_result.\n! Must be destroyed with `duckdb_destroy_data_chunk`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_data_chunk {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_data_chunk"][::std::mem::size_of::<_duckdb_data_chunk>() - 8usize];
    ["Alignment of _duckdb_data_chunk"][::std::mem::align_of::<_duckdb_data_chunk>() - 8usize];
    ["Offset of field: _duckdb_data_chunk::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_data_chunk, internal_ptr) - 0usize];
};
#[doc = "! Contains a data chunk from a duckdb_result.\n! Must be destroyed with `duckdb_destroy_data_chunk`."]
pub type duckdb_data_chunk = *mut _duckdb_data_chunk;
#[doc = "! Holds a DuckDB value, which wraps a type.\n! Must be destroyed with `duckdb_destroy_value`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_value {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_value"][::std::mem::size_of::<_duckdb_value>() - 8usize];
    ["Alignment of _duckdb_value"][::std::mem::align_of::<_duckdb_value>() - 8usize];
    ["Offset of field: _duckdb_value::internal_ptr"][::std::mem::offset_of!(_duckdb_value, internal_ptr) - 0usize];
};
#[doc = "! Holds a DuckDB value, which wraps a type.\n! Must be destroyed with `duckdb_destroy_value`."]
pub type duckdb_value = *mut _duckdb_value;
#[doc = "! Holds a recursive tree that matches the query plan."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_profiling_info {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_profiling_info"][::std::mem::size_of::<_duckdb_profiling_info>() - 8usize];
    ["Alignment of _duckdb_profiling_info"][::std::mem::align_of::<_duckdb_profiling_info>() - 8usize];
    ["Offset of field: _duckdb_profiling_info::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_profiling_info, internal_ptr) - 0usize];
};
#[doc = "! Holds a recursive tree that matches the query plan."]
pub type duckdb_profiling_info = *mut _duckdb_profiling_info;
#[doc = "! Holds state during the C API extension intialization process"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_extension_info {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_extension_info"][::std::mem::size_of::<_duckdb_extension_info>() - 8usize];
    ["Alignment of _duckdb_extension_info"][::std::mem::align_of::<_duckdb_extension_info>() - 8usize];
    ["Offset of field: _duckdb_extension_info::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_extension_info, internal_ptr) - 0usize];
};
#[doc = "! Holds state during the C API extension intialization process"]
pub type duckdb_extension_info = *mut _duckdb_extension_info;
#[doc = "! Additional function info. When setting this info, it is necessary to pass a destroy-callback function."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_function_info {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_function_info"][::std::mem::size_of::<_duckdb_function_info>() - 8usize];
    ["Alignment of _duckdb_function_info"][::std::mem::align_of::<_duckdb_function_info>() - 8usize];
    ["Offset of field: _duckdb_function_info::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_function_info, internal_ptr) - 0usize];
};
#[doc = "! Additional function info. When setting this info, it is necessary to pass a destroy-callback function."]
pub type duckdb_function_info = *mut _duckdb_function_info;
#[doc = "! A scalar function. Must be destroyed with `duckdb_destroy_scalar_function`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_scalar_function {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_scalar_function"][::std::mem::size_of::<_duckdb_scalar_function>() - 8usize];
    ["Alignment of _duckdb_scalar_function"][::std::mem::align_of::<_duckdb_scalar_function>() - 8usize];
    ["Offset of field: _duckdb_scalar_function::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_scalar_function, internal_ptr) - 0usize];
};
#[doc = "! A scalar function. Must be destroyed with `duckdb_destroy_scalar_function`."]
pub type duckdb_scalar_function = *mut _duckdb_scalar_function;
#[doc = "! A scalar function set. Must be destroyed with `duckdb_destroy_scalar_function_set`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_scalar_function_set {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_scalar_function_set"][::std::mem::size_of::<_duckdb_scalar_function_set>() - 8usize];
    ["Alignment of _duckdb_scalar_function_set"][::std::mem::align_of::<_duckdb_scalar_function_set>() - 8usize];
    ["Offset of field: _duckdb_scalar_function_set::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_scalar_function_set, internal_ptr) - 0usize];
};
#[doc = "! A scalar function set. Must be destroyed with `duckdb_destroy_scalar_function_set`."]
pub type duckdb_scalar_function_set = *mut _duckdb_scalar_function_set;
#[doc = "! The main function of the scalar function."]
pub type duckdb_scalar_function_t = ::std::option::Option<
    unsafe extern "C" fn(info: duckdb_function_info, input: duckdb_data_chunk, output: duckdb_vector),
>;
#[doc = "! An aggregate function. Must be destroyed with `duckdb_destroy_aggregate_function`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_aggregate_function {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_aggregate_function"][::std::mem::size_of::<_duckdb_aggregate_function>() - 8usize];
    ["Alignment of _duckdb_aggregate_function"][::std::mem::align_of::<_duckdb_aggregate_function>() - 8usize];
    ["Offset of field: _duckdb_aggregate_function::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_aggregate_function, internal_ptr) - 0usize];
};
#[doc = "! An aggregate function. Must be destroyed with `duckdb_destroy_aggregate_function`."]
pub type duckdb_aggregate_function = *mut _duckdb_aggregate_function;
#[doc = "! A aggregate function set. Must be destroyed with `duckdb_destroy_aggregate_function_set`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_aggregate_function_set {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_aggregate_function_set"][::std::mem::size_of::<_duckdb_aggregate_function_set>() - 8usize];
    ["Alignment of _duckdb_aggregate_function_set"][::std::mem::align_of::<_duckdb_aggregate_function_set>() - 8usize];
    ["Offset of field: _duckdb_aggregate_function_set::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_aggregate_function_set, internal_ptr) - 0usize];
};
#[doc = "! A aggregate function set. Must be destroyed with `duckdb_destroy_aggregate_function_set`."]
pub type duckdb_aggregate_function_set = *mut _duckdb_aggregate_function_set;
#[doc = "! Aggregate state"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_aggregate_state {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_aggregate_state"][::std::mem::size_of::<_duckdb_aggregate_state>() - 8usize];
    ["Alignment of _duckdb_aggregate_state"][::std::mem::align_of::<_duckdb_aggregate_state>() - 8usize];
    ["Offset of field: _duckdb_aggregate_state::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_aggregate_state, internal_ptr) - 0usize];
};
#[doc = "! Aggregate state"]
pub type duckdb_aggregate_state = *mut _duckdb_aggregate_state;
#[doc = "! Returns the aggregate state size"]
pub type duckdb_aggregate_state_size = ::std::option::Option<unsafe extern "C" fn(info: duckdb_function_info) -> idx_t>;
#[doc = "! Initialize the aggregate state"]
pub type duckdb_aggregate_init_t =
    ::std::option::Option<unsafe extern "C" fn(info: duckdb_function_info, state: duckdb_aggregate_state)>;
#[doc = "! Destroy aggregate state (optional)"]
pub type duckdb_aggregate_destroy_t =
    ::std::option::Option<unsafe extern "C" fn(states: *mut duckdb_aggregate_state, count: idx_t)>;
#[doc = "! Update a set of aggregate states with new values"]
pub type duckdb_aggregate_update_t = ::std::option::Option<
    unsafe extern "C" fn(info: duckdb_function_info, input: duckdb_data_chunk, states: *mut duckdb_aggregate_state),
>;
#[doc = "! Combine aggregate states"]
pub type duckdb_aggregate_combine_t = ::std::option::Option<
    unsafe extern "C" fn(
        info: duckdb_function_info,
        source: *mut duckdb_aggregate_state,
        target: *mut duckdb_aggregate_state,
        count: idx_t,
    ),
>;
#[doc = "! Finalize aggregate states into a result vector"]
pub type duckdb_aggregate_finalize_t = ::std::option::Option<
    unsafe extern "C" fn(
        info: duckdb_function_info,
        source: *mut duckdb_aggregate_state,
        result: duckdb_vector,
        count: idx_t,
        offset: idx_t,
    ),
>;
#[doc = "! A table function. Must be destroyed with `duckdb_destroy_table_function`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_table_function {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_table_function"][::std::mem::size_of::<_duckdb_table_function>() - 8usize];
    ["Alignment of _duckdb_table_function"][::std::mem::align_of::<_duckdb_table_function>() - 8usize];
    ["Offset of field: _duckdb_table_function::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_table_function, internal_ptr) - 0usize];
};
#[doc = "! A table function. Must be destroyed with `duckdb_destroy_table_function`."]
pub type duckdb_table_function = *mut _duckdb_table_function;
#[doc = "! The bind info of the function. When setting this info, it is necessary to pass a destroy-callback function."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_bind_info {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_bind_info"][::std::mem::size_of::<_duckdb_bind_info>() - 8usize];
    ["Alignment of _duckdb_bind_info"][::std::mem::align_of::<_duckdb_bind_info>() - 8usize];
    ["Offset of field: _duckdb_bind_info::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_bind_info, internal_ptr) - 0usize];
};
#[doc = "! The bind info of the function. When setting this info, it is necessary to pass a destroy-callback function."]
pub type duckdb_bind_info = *mut _duckdb_bind_info;
#[doc = "! Additional function init info. When setting this info, it is necessary to pass a destroy-callback function."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_init_info {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_init_info"][::std::mem::size_of::<_duckdb_init_info>() - 8usize];
    ["Alignment of _duckdb_init_info"][::std::mem::align_of::<_duckdb_init_info>() - 8usize];
    ["Offset of field: _duckdb_init_info::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_init_info, internal_ptr) - 0usize];
};
#[doc = "! Additional function init info. When setting this info, it is necessary to pass a destroy-callback function."]
pub type duckdb_init_info = *mut _duckdb_init_info;
#[doc = "! The bind function of the table function."]
pub type duckdb_table_function_bind_t = ::std::option::Option<unsafe extern "C" fn(info: duckdb_bind_info)>;
#[doc = "! The (possibly thread-local) init function of the table function."]
pub type duckdb_table_function_init_t = ::std::option::Option<unsafe extern "C" fn(info: duckdb_init_info)>;
#[doc = "! The main function of the table function."]
pub type duckdb_table_function_t =
    ::std::option::Option<unsafe extern "C" fn(info: duckdb_function_info, output: duckdb_data_chunk)>;
#[doc = "! A cast function. Must be destroyed with `duckdb_destroy_cast_function`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_cast_function {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_cast_function"][::std::mem::size_of::<_duckdb_cast_function>() - 8usize];
    ["Alignment of _duckdb_cast_function"][::std::mem::align_of::<_duckdb_cast_function>() - 8usize];
    ["Offset of field: _duckdb_cast_function::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_cast_function, internal_ptr) - 0usize];
};
#[doc = "! A cast function. Must be destroyed with `duckdb_destroy_cast_function`."]
pub type duckdb_cast_function = *mut _duckdb_cast_function;
pub type duckdb_cast_function_t = ::std::option::Option<
    unsafe extern "C" fn(info: duckdb_function_info, count: idx_t, input: duckdb_vector, output: duckdb_vector) -> bool,
>;
#[doc = "! Additional replacement scan info. When setting this info, it is necessary to pass a destroy-callback function."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_replacement_scan_info {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_replacement_scan_info"][::std::mem::size_of::<_duckdb_replacement_scan_info>() - 8usize];
    ["Alignment of _duckdb_replacement_scan_info"][::std::mem::align_of::<_duckdb_replacement_scan_info>() - 8usize];
    ["Offset of field: _duckdb_replacement_scan_info::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_replacement_scan_info, internal_ptr) - 0usize];
};
#[doc = "! Additional replacement scan info. When setting this info, it is necessary to pass a destroy-callback function."]
pub type duckdb_replacement_scan_info = *mut _duckdb_replacement_scan_info;
#[doc = "! A replacement scan function that can be added to a database."]
pub type duckdb_replacement_callback_t = ::std::option::Option<
    unsafe extern "C" fn(
        info: duckdb_replacement_scan_info,
        table_name: *const ::std::os::raw::c_char,
        data: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = "! Holds an arrow query result. Must be destroyed with `duckdb_destroy_arrow`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_arrow {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_arrow"][::std::mem::size_of::<_duckdb_arrow>() - 8usize];
    ["Alignment of _duckdb_arrow"][::std::mem::align_of::<_duckdb_arrow>() - 8usize];
    ["Offset of field: _duckdb_arrow::internal_ptr"][::std::mem::offset_of!(_duckdb_arrow, internal_ptr) - 0usize];
};
#[doc = "! Holds an arrow query result. Must be destroyed with `duckdb_destroy_arrow`."]
pub type duckdb_arrow = *mut _duckdb_arrow;
#[doc = "! Holds an arrow array stream. Must be destroyed with `duckdb_destroy_arrow_stream`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_arrow_stream {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_arrow_stream"][::std::mem::size_of::<_duckdb_arrow_stream>() - 8usize];
    ["Alignment of _duckdb_arrow_stream"][::std::mem::align_of::<_duckdb_arrow_stream>() - 8usize];
    ["Offset of field: _duckdb_arrow_stream::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_arrow_stream, internal_ptr) - 0usize];
};
#[doc = "! Holds an arrow array stream. Must be destroyed with `duckdb_destroy_arrow_stream`."]
pub type duckdb_arrow_stream = *mut _duckdb_arrow_stream;
#[doc = "! Holds an arrow schema. Remember to release the respective ArrowSchema object."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_arrow_schema {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_arrow_schema"][::std::mem::size_of::<_duckdb_arrow_schema>() - 8usize];
    ["Alignment of _duckdb_arrow_schema"][::std::mem::align_of::<_duckdb_arrow_schema>() - 8usize];
    ["Offset of field: _duckdb_arrow_schema::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_arrow_schema, internal_ptr) - 0usize];
};
#[doc = "! Holds an arrow schema. Remember to release the respective ArrowSchema object."]
pub type duckdb_arrow_schema = *mut _duckdb_arrow_schema;
#[doc = "! Holds an arrow array. Remember to release the respective ArrowArray object."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _duckdb_arrow_array {
    pub internal_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _duckdb_arrow_array"][::std::mem::size_of::<_duckdb_arrow_array>() - 8usize];
    ["Alignment of _duckdb_arrow_array"][::std::mem::align_of::<_duckdb_arrow_array>() - 8usize];
    ["Offset of field: _duckdb_arrow_array::internal_ptr"]
        [::std::mem::offset_of!(_duckdb_arrow_array, internal_ptr) - 0usize];
};
#[doc = "! Holds an arrow array. Remember to release the respective ArrowArray object."]
pub type duckdb_arrow_array = *mut _duckdb_arrow_array;
#[doc = "! Passed to C API extension as parameter to the entrypoint"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_extension_access {
    #[doc = "! Indicate that an error has occurred"]
    pub set_error:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_extension_info, error: *const ::std::os::raw::c_char)>,
    #[doc = "! Fetch the database from duckdb to register extensions to"]
    pub get_database: ::std::option::Option<unsafe extern "C" fn(info: duckdb_extension_info) -> *mut duckdb_database>,
    #[doc = "! Fetch the API"]
    pub get_api: ::std::option::Option<
        unsafe extern "C" fn(
            info: duckdb_extension_info,
            version: *const ::std::os::raw::c_char,
        ) -> *const ::std::os::raw::c_void,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_extension_access"][::std::mem::size_of::<duckdb_extension_access>() - 24usize];
    ["Alignment of duckdb_extension_access"][::std::mem::align_of::<duckdb_extension_access>() - 8usize];
    ["Offset of field: duckdb_extension_access::set_error"]
        [::std::mem::offset_of!(duckdb_extension_access, set_error) - 0usize];
    ["Offset of field: duckdb_extension_access::get_database"]
        [::std::mem::offset_of!(duckdb_extension_access, get_database) - 8usize];
    ["Offset of field: duckdb_extension_access::get_api"]
        [::std::mem::offset_of!(duckdb_extension_access, get_api) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct duckdb_ext_api_v1 {
    pub duckdb_open: ::std::option::Option<
        unsafe extern "C" fn(path: *const ::std::os::raw::c_char, out_database: *mut duckdb_database) -> duckdb_state,
    >,
    pub duckdb_open_ext: ::std::option::Option<
        unsafe extern "C" fn(
            path: *const ::std::os::raw::c_char,
            out_database: *mut duckdb_database,
            config: duckdb_config,
            out_error: *mut *mut ::std::os::raw::c_char,
        ) -> duckdb_state,
    >,
    pub duckdb_close: ::std::option::Option<unsafe extern "C" fn(database: *mut duckdb_database)>,
    pub duckdb_connect: ::std::option::Option<
        unsafe extern "C" fn(database: duckdb_database, out_connection: *mut duckdb_connection) -> duckdb_state,
    >,
    pub duckdb_interrupt: ::std::option::Option<unsafe extern "C" fn(connection: duckdb_connection)>,
    pub duckdb_query_progress:
        ::std::option::Option<unsafe extern "C" fn(connection: duckdb_connection) -> duckdb_query_progress_type>,
    pub duckdb_disconnect: ::std::option::Option<unsafe extern "C" fn(connection: *mut duckdb_connection)>,
    pub duckdb_library_version: ::std::option::Option<unsafe extern "C" fn() -> *const ::std::os::raw::c_char>,
    pub duckdb_create_config:
        ::std::option::Option<unsafe extern "C" fn(out_config: *mut duckdb_config) -> duckdb_state>,
    pub duckdb_config_count: ::std::option::Option<unsafe extern "C" fn() -> usize>,
    pub duckdb_get_config_flag: ::std::option::Option<
        unsafe extern "C" fn(
            index: usize,
            out_name: *mut *const ::std::os::raw::c_char,
            out_description: *mut *const ::std::os::raw::c_char,
        ) -> duckdb_state,
    >,
    pub duckdb_set_config: ::std::option::Option<
        unsafe extern "C" fn(
            config: duckdb_config,
            name: *const ::std::os::raw::c_char,
            option: *const ::std::os::raw::c_char,
        ) -> duckdb_state,
    >,
    pub duckdb_destroy_config: ::std::option::Option<unsafe extern "C" fn(config: *mut duckdb_config)>,
    pub duckdb_query: ::std::option::Option<
        unsafe extern "C" fn(
            connection: duckdb_connection,
            query: *const ::std::os::raw::c_char,
            out_result: *mut duckdb_result,
        ) -> duckdb_state,
    >,
    pub duckdb_destroy_result: ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result)>,
    pub duckdb_column_name: ::std::option::Option<
        unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t) -> *const ::std::os::raw::c_char,
    >,
    pub duckdb_column_type:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t) -> duckdb_type>,
    pub duckdb_result_statement_type:
        ::std::option::Option<unsafe extern "C" fn(result: duckdb_result) -> duckdb_statement_type>,
    pub duckdb_column_logical_type:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t) -> duckdb_logical_type>,
    pub duckdb_column_count: ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result) -> idx_t>,
    pub duckdb_rows_changed: ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result) -> idx_t>,
    pub duckdb_result_error:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result) -> *const ::std::os::raw::c_char>,
    pub duckdb_result_error_type:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result) -> duckdb_error_type>,
    pub duckdb_result_return_type:
        ::std::option::Option<unsafe extern "C" fn(result: duckdb_result) -> duckdb_result_type>,
    pub duckdb_malloc: ::std::option::Option<unsafe extern "C" fn(size: usize) -> *mut ::std::os::raw::c_void>,
    pub duckdb_free: ::std::option::Option<unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void)>,
    pub duckdb_vector_size: ::std::option::Option<unsafe extern "C" fn() -> idx_t>,
    pub duckdb_string_is_inlined: ::std::option::Option<unsafe extern "C" fn(string: duckdb_string_t) -> bool>,
    pub duckdb_string_t_length: ::std::option::Option<unsafe extern "C" fn(string: duckdb_string_t) -> u32>,
    pub duckdb_string_t_data:
        ::std::option::Option<unsafe extern "C" fn(string: *mut duckdb_string_t) -> *const ::std::os::raw::c_char>,
    pub duckdb_from_date: ::std::option::Option<unsafe extern "C" fn(date: duckdb_date) -> duckdb_date_struct>,
    pub duckdb_to_date: ::std::option::Option<unsafe extern "C" fn(date: duckdb_date_struct) -> duckdb_date>,
    pub duckdb_is_finite_date: ::std::option::Option<unsafe extern "C" fn(date: duckdb_date) -> bool>,
    pub duckdb_from_time: ::std::option::Option<unsafe extern "C" fn(time: duckdb_time) -> duckdb_time_struct>,
    pub duckdb_create_time_tz: ::std::option::Option<unsafe extern "C" fn(micros: i64, offset: i32) -> duckdb_time_tz>,
    pub duckdb_from_time_tz:
        ::std::option::Option<unsafe extern "C" fn(micros: duckdb_time_tz) -> duckdb_time_tz_struct>,
    pub duckdb_to_time: ::std::option::Option<unsafe extern "C" fn(time: duckdb_time_struct) -> duckdb_time>,
    pub duckdb_from_timestamp:
        ::std::option::Option<unsafe extern "C" fn(ts: duckdb_timestamp) -> duckdb_timestamp_struct>,
    pub duckdb_to_timestamp:
        ::std::option::Option<unsafe extern "C" fn(ts: duckdb_timestamp_struct) -> duckdb_timestamp>,
    pub duckdb_is_finite_timestamp: ::std::option::Option<unsafe extern "C" fn(ts: duckdb_timestamp) -> bool>,
    pub duckdb_hugeint_to_double: ::std::option::Option<unsafe extern "C" fn(val: duckdb_hugeint) -> f64>,
    pub duckdb_double_to_hugeint: ::std::option::Option<unsafe extern "C" fn(val: f64) -> duckdb_hugeint>,
    pub duckdb_uhugeint_to_double: ::std::option::Option<unsafe extern "C" fn(val: duckdb_uhugeint) -> f64>,
    pub duckdb_double_to_uhugeint: ::std::option::Option<unsafe extern "C" fn(val: f64) -> duckdb_uhugeint>,
    pub duckdb_double_to_decimal:
        ::std::option::Option<unsafe extern "C" fn(val: f64, width: u8, scale: u8) -> duckdb_decimal>,
    pub duckdb_decimal_to_double: ::std::option::Option<unsafe extern "C" fn(val: duckdb_decimal) -> f64>,
    pub duckdb_prepare: ::std::option::Option<
        unsafe extern "C" fn(
            connection: duckdb_connection,
            query: *const ::std::os::raw::c_char,
            out_prepared_statement: *mut duckdb_prepared_statement,
        ) -> duckdb_state,
    >,
    pub duckdb_destroy_prepare:
        ::std::option::Option<unsafe extern "C" fn(prepared_statement: *mut duckdb_prepared_statement)>,
    pub duckdb_prepare_error: ::std::option::Option<
        unsafe extern "C" fn(prepared_statement: duckdb_prepared_statement) -> *const ::std::os::raw::c_char,
    >,
    pub duckdb_nparams:
        ::std::option::Option<unsafe extern "C" fn(prepared_statement: duckdb_prepared_statement) -> idx_t>,
    pub duckdb_parameter_name: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            index: idx_t,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub duckdb_param_type: ::std::option::Option<
        unsafe extern "C" fn(prepared_statement: duckdb_prepared_statement, param_idx: idx_t) -> duckdb_type,
    >,
    pub duckdb_param_logical_type: ::std::option::Option<
        unsafe extern "C" fn(prepared_statement: duckdb_prepared_statement, param_idx: idx_t) -> duckdb_logical_type,
    >,
    pub duckdb_clear_bindings:
        ::std::option::Option<unsafe extern "C" fn(prepared_statement: duckdb_prepared_statement) -> duckdb_state>,
    pub duckdb_prepared_statement_type:
        ::std::option::Option<unsafe extern "C" fn(statement: duckdb_prepared_statement) -> duckdb_statement_type>,
    pub duckdb_bind_value: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            param_idx: idx_t,
            val: duckdb_value,
        ) -> duckdb_state,
    >,
    pub duckdb_bind_parameter_index: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            param_idx_out: *mut idx_t,
            name: *const ::std::os::raw::c_char,
        ) -> duckdb_state,
    >,
    pub duckdb_bind_boolean: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            param_idx: idx_t,
            val: bool,
        ) -> duckdb_state,
    >,
    pub duckdb_bind_int8: ::std::option::Option<
        unsafe extern "C" fn(prepared_statement: duckdb_prepared_statement, param_idx: idx_t, val: i8) -> duckdb_state,
    >,
    pub duckdb_bind_int16: ::std::option::Option<
        unsafe extern "C" fn(prepared_statement: duckdb_prepared_statement, param_idx: idx_t, val: i16) -> duckdb_state,
    >,
    pub duckdb_bind_int32: ::std::option::Option<
        unsafe extern "C" fn(prepared_statement: duckdb_prepared_statement, param_idx: idx_t, val: i32) -> duckdb_state,
    >,
    pub duckdb_bind_int64: ::std::option::Option<
        unsafe extern "C" fn(prepared_statement: duckdb_prepared_statement, param_idx: idx_t, val: i64) -> duckdb_state,
    >,
    pub duckdb_bind_hugeint: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            param_idx: idx_t,
            val: duckdb_hugeint,
        ) -> duckdb_state,
    >,
    pub duckdb_bind_uhugeint: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            param_idx: idx_t,
            val: duckdb_uhugeint,
        ) -> duckdb_state,
    >,
    pub duckdb_bind_decimal: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            param_idx: idx_t,
            val: duckdb_decimal,
        ) -> duckdb_state,
    >,
    pub duckdb_bind_uint8: ::std::option::Option<
        unsafe extern "C" fn(prepared_statement: duckdb_prepared_statement, param_idx: idx_t, val: u8) -> duckdb_state,
    >,
    pub duckdb_bind_uint16: ::std::option::Option<
        unsafe extern "C" fn(prepared_statement: duckdb_prepared_statement, param_idx: idx_t, val: u16) -> duckdb_state,
    >,
    pub duckdb_bind_uint32: ::std::option::Option<
        unsafe extern "C" fn(prepared_statement: duckdb_prepared_statement, param_idx: idx_t, val: u32) -> duckdb_state,
    >,
    pub duckdb_bind_uint64: ::std::option::Option<
        unsafe extern "C" fn(prepared_statement: duckdb_prepared_statement, param_idx: idx_t, val: u64) -> duckdb_state,
    >,
    pub duckdb_bind_float: ::std::option::Option<
        unsafe extern "C" fn(prepared_statement: duckdb_prepared_statement, param_idx: idx_t, val: f32) -> duckdb_state,
    >,
    pub duckdb_bind_double: ::std::option::Option<
        unsafe extern "C" fn(prepared_statement: duckdb_prepared_statement, param_idx: idx_t, val: f64) -> duckdb_state,
    >,
    pub duckdb_bind_date: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            param_idx: idx_t,
            val: duckdb_date,
        ) -> duckdb_state,
    >,
    pub duckdb_bind_time: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            param_idx: idx_t,
            val: duckdb_time,
        ) -> duckdb_state,
    >,
    pub duckdb_bind_timestamp: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            param_idx: idx_t,
            val: duckdb_timestamp,
        ) -> duckdb_state,
    >,
    pub duckdb_bind_timestamp_tz: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            param_idx: idx_t,
            val: duckdb_timestamp,
        ) -> duckdb_state,
    >,
    pub duckdb_bind_interval: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            param_idx: idx_t,
            val: duckdb_interval,
        ) -> duckdb_state,
    >,
    pub duckdb_bind_varchar: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            param_idx: idx_t,
            val: *const ::std::os::raw::c_char,
        ) -> duckdb_state,
    >,
    pub duckdb_bind_varchar_length: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            param_idx: idx_t,
            val: *const ::std::os::raw::c_char,
            length: idx_t,
        ) -> duckdb_state,
    >,
    pub duckdb_bind_blob: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            param_idx: idx_t,
            data: *const ::std::os::raw::c_void,
            length: idx_t,
        ) -> duckdb_state,
    >,
    pub duckdb_bind_null: ::std::option::Option<
        unsafe extern "C" fn(prepared_statement: duckdb_prepared_statement, param_idx: idx_t) -> duckdb_state,
    >,
    pub duckdb_execute_prepared: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            out_result: *mut duckdb_result,
        ) -> duckdb_state,
    >,
    pub duckdb_extract_statements: ::std::option::Option<
        unsafe extern "C" fn(
            connection: duckdb_connection,
            query: *const ::std::os::raw::c_char,
            out_extracted_statements: *mut duckdb_extracted_statements,
        ) -> idx_t,
    >,
    pub duckdb_prepare_extracted_statement: ::std::option::Option<
        unsafe extern "C" fn(
            connection: duckdb_connection,
            extracted_statements: duckdb_extracted_statements,
            index: idx_t,
            out_prepared_statement: *mut duckdb_prepared_statement,
        ) -> duckdb_state,
    >,
    pub duckdb_extract_statements_error: ::std::option::Option<
        unsafe extern "C" fn(extracted_statements: duckdb_extracted_statements) -> *const ::std::os::raw::c_char,
    >,
    pub duckdb_destroy_extracted:
        ::std::option::Option<unsafe extern "C" fn(extracted_statements: *mut duckdb_extracted_statements)>,
    pub duckdb_pending_prepared: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            out_result: *mut duckdb_pending_result,
        ) -> duckdb_state,
    >,
    pub duckdb_destroy_pending: ::std::option::Option<unsafe extern "C" fn(pending_result: *mut duckdb_pending_result)>,
    pub duckdb_pending_error: ::std::option::Option<
        unsafe extern "C" fn(pending_result: duckdb_pending_result) -> *const ::std::os::raw::c_char,
    >,
    pub duckdb_pending_execute_task:
        ::std::option::Option<unsafe extern "C" fn(pending_result: duckdb_pending_result) -> duckdb_pending_state>,
    pub duckdb_pending_execute_check_state:
        ::std::option::Option<unsafe extern "C" fn(pending_result: duckdb_pending_result) -> duckdb_pending_state>,
    pub duckdb_execute_pending: ::std::option::Option<
        unsafe extern "C" fn(pending_result: duckdb_pending_result, out_result: *mut duckdb_result) -> duckdb_state,
    >,
    pub duckdb_pending_execution_is_finished:
        ::std::option::Option<unsafe extern "C" fn(pending_state: duckdb_pending_state) -> bool>,
    pub duckdb_destroy_value: ::std::option::Option<unsafe extern "C" fn(value: *mut duckdb_value)>,
    pub duckdb_create_varchar:
        ::std::option::Option<unsafe extern "C" fn(text: *const ::std::os::raw::c_char) -> duckdb_value>,
    pub duckdb_create_varchar_length:
        ::std::option::Option<unsafe extern "C" fn(text: *const ::std::os::raw::c_char, length: idx_t) -> duckdb_value>,
    pub duckdb_create_bool: ::std::option::Option<unsafe extern "C" fn(input: bool) -> duckdb_value>,
    pub duckdb_create_int8: ::std::option::Option<unsafe extern "C" fn(input: i8) -> duckdb_value>,
    pub duckdb_create_uint8: ::std::option::Option<unsafe extern "C" fn(input: u8) -> duckdb_value>,
    pub duckdb_create_int16: ::std::option::Option<unsafe extern "C" fn(input: i16) -> duckdb_value>,
    pub duckdb_create_uint16: ::std::option::Option<unsafe extern "C" fn(input: u16) -> duckdb_value>,
    pub duckdb_create_int32: ::std::option::Option<unsafe extern "C" fn(input: i32) -> duckdb_value>,
    pub duckdb_create_uint32: ::std::option::Option<unsafe extern "C" fn(input: u32) -> duckdb_value>,
    pub duckdb_create_uint64: ::std::option::Option<unsafe extern "C" fn(input: u64) -> duckdb_value>,
    pub duckdb_create_int64: ::std::option::Option<unsafe extern "C" fn(val: i64) -> duckdb_value>,
    pub duckdb_create_hugeint: ::std::option::Option<unsafe extern "C" fn(input: duckdb_hugeint) -> duckdb_value>,
    pub duckdb_create_uhugeint: ::std::option::Option<unsafe extern "C" fn(input: duckdb_uhugeint) -> duckdb_value>,
    pub duckdb_create_float: ::std::option::Option<unsafe extern "C" fn(input: f32) -> duckdb_value>,
    pub duckdb_create_double: ::std::option::Option<unsafe extern "C" fn(input: f64) -> duckdb_value>,
    pub duckdb_create_date: ::std::option::Option<unsafe extern "C" fn(input: duckdb_date) -> duckdb_value>,
    pub duckdb_create_time: ::std::option::Option<unsafe extern "C" fn(input: duckdb_time) -> duckdb_value>,
    pub duckdb_create_time_tz_value: ::std::option::Option<unsafe extern "C" fn(value: duckdb_time_tz) -> duckdb_value>,
    pub duckdb_create_timestamp: ::std::option::Option<unsafe extern "C" fn(input: duckdb_timestamp) -> duckdb_value>,
    pub duckdb_create_interval: ::std::option::Option<unsafe extern "C" fn(input: duckdb_interval) -> duckdb_value>,
    pub duckdb_create_blob: ::std::option::Option<unsafe extern "C" fn(data: *const u8, length: idx_t) -> duckdb_value>,
    pub duckdb_create_varint: ::std::option::Option<unsafe extern "C" fn(input: duckdb_varint) -> duckdb_value>,
    pub duckdb_create_decimal: ::std::option::Option<unsafe extern "C" fn(input: duckdb_decimal) -> duckdb_value>,
    pub duckdb_create_bit: ::std::option::Option<unsafe extern "C" fn(input: duckdb_bit) -> duckdb_value>,
    pub duckdb_create_uuid: ::std::option::Option<unsafe extern "C" fn(input: duckdb_uhugeint) -> duckdb_value>,
    pub duckdb_get_bool: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> bool>,
    pub duckdb_get_int8: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> i8>,
    pub duckdb_get_uint8: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> u8>,
    pub duckdb_get_int16: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> i16>,
    pub duckdb_get_uint16: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> u16>,
    pub duckdb_get_int32: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> i32>,
    pub duckdb_get_uint32: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> u32>,
    pub duckdb_get_int64: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> i64>,
    pub duckdb_get_uint64: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> u64>,
    pub duckdb_get_hugeint: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> duckdb_hugeint>,
    pub duckdb_get_uhugeint: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> duckdb_uhugeint>,
    pub duckdb_get_float: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> f32>,
    pub duckdb_get_double: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> f64>,
    pub duckdb_get_date: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> duckdb_date>,
    pub duckdb_get_time: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> duckdb_time>,
    pub duckdb_get_time_tz: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> duckdb_time_tz>,
    pub duckdb_get_timestamp: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> duckdb_timestamp>,
    pub duckdb_get_interval: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> duckdb_interval>,
    pub duckdb_get_value_type: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> duckdb_logical_type>,
    pub duckdb_get_blob: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> duckdb_blob>,
    pub duckdb_get_varint: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> duckdb_varint>,
    pub duckdb_get_decimal: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> duckdb_decimal>,
    pub duckdb_get_bit: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> duckdb_bit>,
    pub duckdb_get_uuid: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> duckdb_uhugeint>,
    pub duckdb_get_varchar:
        ::std::option::Option<unsafe extern "C" fn(value: duckdb_value) -> *mut ::std::os::raw::c_char>,
    pub duckdb_create_struct_value: ::std::option::Option<
        unsafe extern "C" fn(type_: duckdb_logical_type, values: *mut duckdb_value) -> duckdb_value,
    >,
    pub duckdb_create_list_value: ::std::option::Option<
        unsafe extern "C" fn(type_: duckdb_logical_type, values: *mut duckdb_value, value_count: idx_t) -> duckdb_value,
    >,
    pub duckdb_create_array_value: ::std::option::Option<
        unsafe extern "C" fn(type_: duckdb_logical_type, values: *mut duckdb_value, value_count: idx_t) -> duckdb_value,
    >,
    pub duckdb_get_map_size: ::std::option::Option<unsafe extern "C" fn(value: duckdb_value) -> idx_t>,
    pub duckdb_get_map_key:
        ::std::option::Option<unsafe extern "C" fn(value: duckdb_value, index: idx_t) -> duckdb_value>,
    pub duckdb_get_map_value:
        ::std::option::Option<unsafe extern "C" fn(value: duckdb_value, index: idx_t) -> duckdb_value>,
    pub duckdb_is_null_value: ::std::option::Option<unsafe extern "C" fn(value: duckdb_value) -> bool>,
    pub duckdb_create_null_value: ::std::option::Option<unsafe extern "C" fn() -> duckdb_value>,
    pub duckdb_get_list_size: ::std::option::Option<unsafe extern "C" fn(value: duckdb_value) -> idx_t>,
    pub duckdb_get_list_child:
        ::std::option::Option<unsafe extern "C" fn(value: duckdb_value, index: idx_t) -> duckdb_value>,
    pub duckdb_create_enum_value:
        ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type, value: u64) -> duckdb_value>,
    pub duckdb_get_enum_value: ::std::option::Option<unsafe extern "C" fn(value: duckdb_value) -> u64>,
    pub duckdb_get_struct_child:
        ::std::option::Option<unsafe extern "C" fn(value: duckdb_value, index: idx_t) -> duckdb_value>,
    pub duckdb_create_logical_type:
        ::std::option::Option<unsafe extern "C" fn(type_: duckdb_type) -> duckdb_logical_type>,
    pub duckdb_logical_type_get_alias:
        ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type) -> *mut ::std::os::raw::c_char>,
    pub duckdb_logical_type_set_alias:
        ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type, alias: *const ::std::os::raw::c_char)>,
    pub duckdb_create_list_type:
        ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type) -> duckdb_logical_type>,
    pub duckdb_create_array_type: ::std::option::Option<
        unsafe extern "C" fn(type_: duckdb_logical_type, array_size: idx_t) -> duckdb_logical_type,
    >,
    pub duckdb_create_map_type: ::std::option::Option<
        unsafe extern "C" fn(key_type: duckdb_logical_type, value_type: duckdb_logical_type) -> duckdb_logical_type,
    >,
    pub duckdb_create_union_type: ::std::option::Option<
        unsafe extern "C" fn(
            member_types: *mut duckdb_logical_type,
            member_names: *mut *const ::std::os::raw::c_char,
            member_count: idx_t,
        ) -> duckdb_logical_type,
    >,
    pub duckdb_create_struct_type: ::std::option::Option<
        unsafe extern "C" fn(
            member_types: *mut duckdb_logical_type,
            member_names: *mut *const ::std::os::raw::c_char,
            member_count: idx_t,
        ) -> duckdb_logical_type,
    >,
    pub duckdb_create_enum_type: ::std::option::Option<
        unsafe extern "C" fn(
            member_names: *mut *const ::std::os::raw::c_char,
            member_count: idx_t,
        ) -> duckdb_logical_type,
    >,
    pub duckdb_create_decimal_type:
        ::std::option::Option<unsafe extern "C" fn(width: u8, scale: u8) -> duckdb_logical_type>,
    pub duckdb_get_type_id: ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type) -> duckdb_type>,
    pub duckdb_decimal_width: ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type) -> u8>,
    pub duckdb_decimal_scale: ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type) -> u8>,
    pub duckdb_decimal_internal_type:
        ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type) -> duckdb_type>,
    pub duckdb_enum_internal_type:
        ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type) -> duckdb_type>,
    pub duckdb_enum_dictionary_size: ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type) -> u32>,
    pub duckdb_enum_dictionary_value: ::std::option::Option<
        unsafe extern "C" fn(type_: duckdb_logical_type, index: idx_t) -> *mut ::std::os::raw::c_char,
    >,
    pub duckdb_list_type_child_type:
        ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type) -> duckdb_logical_type>,
    pub duckdb_array_type_child_type:
        ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type) -> duckdb_logical_type>,
    pub duckdb_array_type_array_size: ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type) -> idx_t>,
    pub duckdb_map_type_key_type:
        ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type) -> duckdb_logical_type>,
    pub duckdb_map_type_value_type:
        ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type) -> duckdb_logical_type>,
    pub duckdb_struct_type_child_count:
        ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type) -> idx_t>,
    pub duckdb_struct_type_child_name: ::std::option::Option<
        unsafe extern "C" fn(type_: duckdb_logical_type, index: idx_t) -> *mut ::std::os::raw::c_char,
    >,
    pub duckdb_struct_type_child_type:
        ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type, index: idx_t) -> duckdb_logical_type>,
    pub duckdb_union_type_member_count:
        ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type) -> idx_t>,
    pub duckdb_union_type_member_name: ::std::option::Option<
        unsafe extern "C" fn(type_: duckdb_logical_type, index: idx_t) -> *mut ::std::os::raw::c_char,
    >,
    pub duckdb_union_type_member_type:
        ::std::option::Option<unsafe extern "C" fn(type_: duckdb_logical_type, index: idx_t) -> duckdb_logical_type>,
    pub duckdb_destroy_logical_type: ::std::option::Option<unsafe extern "C" fn(type_: *mut duckdb_logical_type)>,
    pub duckdb_register_logical_type: ::std::option::Option<
        unsafe extern "C" fn(
            con: duckdb_connection,
            type_: duckdb_logical_type,
            info: duckdb_create_type_info,
        ) -> duckdb_state,
    >,
    pub duckdb_create_data_chunk: ::std::option::Option<
        unsafe extern "C" fn(types: *mut duckdb_logical_type, column_count: idx_t) -> duckdb_data_chunk,
    >,
    pub duckdb_destroy_data_chunk: ::std::option::Option<unsafe extern "C" fn(chunk: *mut duckdb_data_chunk)>,
    pub duckdb_data_chunk_reset: ::std::option::Option<unsafe extern "C" fn(chunk: duckdb_data_chunk)>,
    pub duckdb_data_chunk_get_column_count:
        ::std::option::Option<unsafe extern "C" fn(chunk: duckdb_data_chunk) -> idx_t>,
    pub duckdb_data_chunk_get_vector:
        ::std::option::Option<unsafe extern "C" fn(chunk: duckdb_data_chunk, col_idx: idx_t) -> duckdb_vector>,
    pub duckdb_data_chunk_get_size: ::std::option::Option<unsafe extern "C" fn(chunk: duckdb_data_chunk) -> idx_t>,
    pub duckdb_data_chunk_set_size: ::std::option::Option<unsafe extern "C" fn(chunk: duckdb_data_chunk, size: idx_t)>,
    pub duckdb_vector_get_column_type:
        ::std::option::Option<unsafe extern "C" fn(vector: duckdb_vector) -> duckdb_logical_type>,
    pub duckdb_vector_get_data:
        ::std::option::Option<unsafe extern "C" fn(vector: duckdb_vector) -> *mut ::std::os::raw::c_void>,
    pub duckdb_vector_get_validity: ::std::option::Option<unsafe extern "C" fn(vector: duckdb_vector) -> *mut u64>,
    pub duckdb_vector_ensure_validity_writable: ::std::option::Option<unsafe extern "C" fn(vector: duckdb_vector)>,
    pub duckdb_vector_assign_string_element: ::std::option::Option<
        unsafe extern "C" fn(vector: duckdb_vector, index: idx_t, str_: *const ::std::os::raw::c_char),
    >,
    pub duckdb_vector_assign_string_element_len: ::std::option::Option<
        unsafe extern "C" fn(vector: duckdb_vector, index: idx_t, str_: *const ::std::os::raw::c_char, str_len: idx_t),
    >,
    pub duckdb_list_vector_get_child:
        ::std::option::Option<unsafe extern "C" fn(vector: duckdb_vector) -> duckdb_vector>,
    pub duckdb_list_vector_get_size: ::std::option::Option<unsafe extern "C" fn(vector: duckdb_vector) -> idx_t>,
    pub duckdb_list_vector_set_size:
        ::std::option::Option<unsafe extern "C" fn(vector: duckdb_vector, size: idx_t) -> duckdb_state>,
    pub duckdb_list_vector_reserve:
        ::std::option::Option<unsafe extern "C" fn(vector: duckdb_vector, required_capacity: idx_t) -> duckdb_state>,
    pub duckdb_struct_vector_get_child:
        ::std::option::Option<unsafe extern "C" fn(vector: duckdb_vector, index: idx_t) -> duckdb_vector>,
    pub duckdb_array_vector_get_child:
        ::std::option::Option<unsafe extern "C" fn(vector: duckdb_vector) -> duckdb_vector>,
    pub duckdb_validity_row_is_valid:
        ::std::option::Option<unsafe extern "C" fn(validity: *mut u64, row: idx_t) -> bool>,
    pub duckdb_validity_set_row_validity:
        ::std::option::Option<unsafe extern "C" fn(validity: *mut u64, row: idx_t, valid: bool)>,
    pub duckdb_validity_set_row_invalid: ::std::option::Option<unsafe extern "C" fn(validity: *mut u64, row: idx_t)>,
    pub duckdb_validity_set_row_valid: ::std::option::Option<unsafe extern "C" fn(validity: *mut u64, row: idx_t)>,
    pub duckdb_create_scalar_function: ::std::option::Option<unsafe extern "C" fn() -> duckdb_scalar_function>,
    pub duckdb_destroy_scalar_function:
        ::std::option::Option<unsafe extern "C" fn(scalar_function: *mut duckdb_scalar_function)>,
    pub duckdb_scalar_function_set_name: ::std::option::Option<
        unsafe extern "C" fn(scalar_function: duckdb_scalar_function, name: *const ::std::os::raw::c_char),
    >,
    pub duckdb_scalar_function_set_varargs: ::std::option::Option<
        unsafe extern "C" fn(scalar_function: duckdb_scalar_function, type_: duckdb_logical_type),
    >,
    pub duckdb_scalar_function_set_special_handling:
        ::std::option::Option<unsafe extern "C" fn(scalar_function: duckdb_scalar_function)>,
    pub duckdb_scalar_function_set_volatile:
        ::std::option::Option<unsafe extern "C" fn(scalar_function: duckdb_scalar_function)>,
    pub duckdb_scalar_function_add_parameter: ::std::option::Option<
        unsafe extern "C" fn(scalar_function: duckdb_scalar_function, type_: duckdb_logical_type),
    >,
    pub duckdb_scalar_function_set_return_type: ::std::option::Option<
        unsafe extern "C" fn(scalar_function: duckdb_scalar_function, type_: duckdb_logical_type),
    >,
    pub duckdb_scalar_function_set_extra_info: ::std::option::Option<
        unsafe extern "C" fn(
            scalar_function: duckdb_scalar_function,
            extra_info: *mut ::std::os::raw::c_void,
            destroy: duckdb_delete_callback_t,
        ),
    >,
    pub duckdb_scalar_function_set_function: ::std::option::Option<
        unsafe extern "C" fn(scalar_function: duckdb_scalar_function, function: duckdb_scalar_function_t),
    >,
    pub duckdb_register_scalar_function: ::std::option::Option<
        unsafe extern "C" fn(con: duckdb_connection, scalar_function: duckdb_scalar_function) -> duckdb_state,
    >,
    pub duckdb_scalar_function_get_extra_info:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_function_info) -> *mut ::std::os::raw::c_void>,
    pub duckdb_scalar_function_set_error:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_function_info, error: *const ::std::os::raw::c_char)>,
    pub duckdb_create_scalar_function_set:
        ::std::option::Option<unsafe extern "C" fn(name: *const ::std::os::raw::c_char) -> duckdb_scalar_function_set>,
    pub duckdb_destroy_scalar_function_set:
        ::std::option::Option<unsafe extern "C" fn(scalar_function_set: *mut duckdb_scalar_function_set)>,
    pub duckdb_add_scalar_function_to_set: ::std::option::Option<
        unsafe extern "C" fn(set: duckdb_scalar_function_set, function: duckdb_scalar_function) -> duckdb_state,
    >,
    pub duckdb_register_scalar_function_set: ::std::option::Option<
        unsafe extern "C" fn(con: duckdb_connection, set: duckdb_scalar_function_set) -> duckdb_state,
    >,
    pub duckdb_create_aggregate_function: ::std::option::Option<unsafe extern "C" fn() -> duckdb_aggregate_function>,
    pub duckdb_destroy_aggregate_function:
        ::std::option::Option<unsafe extern "C" fn(aggregate_function: *mut duckdb_aggregate_function)>,
    pub duckdb_aggregate_function_set_name: ::std::option::Option<
        unsafe extern "C" fn(aggregate_function: duckdb_aggregate_function, name: *const ::std::os::raw::c_char),
    >,
    pub duckdb_aggregate_function_add_parameter: ::std::option::Option<
        unsafe extern "C" fn(aggregate_function: duckdb_aggregate_function, type_: duckdb_logical_type),
    >,
    pub duckdb_aggregate_function_set_return_type: ::std::option::Option<
        unsafe extern "C" fn(aggregate_function: duckdb_aggregate_function, type_: duckdb_logical_type),
    >,
    pub duckdb_aggregate_function_set_functions: ::std::option::Option<
        unsafe extern "C" fn(
            aggregate_function: duckdb_aggregate_function,
            state_size: duckdb_aggregate_state_size,
            state_init: duckdb_aggregate_init_t,
            update: duckdb_aggregate_update_t,
            combine: duckdb_aggregate_combine_t,
            finalize: duckdb_aggregate_finalize_t,
        ),
    >,
    pub duckdb_aggregate_function_set_destructor: ::std::option::Option<
        unsafe extern "C" fn(aggregate_function: duckdb_aggregate_function, destroy: duckdb_aggregate_destroy_t),
    >,
    pub duckdb_register_aggregate_function: ::std::option::Option<
        unsafe extern "C" fn(con: duckdb_connection, aggregate_function: duckdb_aggregate_function) -> duckdb_state,
    >,
    pub duckdb_aggregate_function_set_special_handling:
        ::std::option::Option<unsafe extern "C" fn(aggregate_function: duckdb_aggregate_function)>,
    pub duckdb_aggregate_function_set_extra_info: ::std::option::Option<
        unsafe extern "C" fn(
            aggregate_function: duckdb_aggregate_function,
            extra_info: *mut ::std::os::raw::c_void,
            destroy: duckdb_delete_callback_t,
        ),
    >,
    pub duckdb_aggregate_function_get_extra_info:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_function_info) -> *mut ::std::os::raw::c_void>,
    pub duckdb_aggregate_function_set_error:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_function_info, error: *const ::std::os::raw::c_char)>,
    pub duckdb_create_aggregate_function_set: ::std::option::Option<
        unsafe extern "C" fn(name: *const ::std::os::raw::c_char) -> duckdb_aggregate_function_set,
    >,
    pub duckdb_destroy_aggregate_function_set:
        ::std::option::Option<unsafe extern "C" fn(aggregate_function_set: *mut duckdb_aggregate_function_set)>,
    pub duckdb_add_aggregate_function_to_set: ::std::option::Option<
        unsafe extern "C" fn(set: duckdb_aggregate_function_set, function: duckdb_aggregate_function) -> duckdb_state,
    >,
    pub duckdb_register_aggregate_function_set: ::std::option::Option<
        unsafe extern "C" fn(con: duckdb_connection, set: duckdb_aggregate_function_set) -> duckdb_state,
    >,
    pub duckdb_create_table_function: ::std::option::Option<unsafe extern "C" fn() -> duckdb_table_function>,
    pub duckdb_destroy_table_function:
        ::std::option::Option<unsafe extern "C" fn(table_function: *mut duckdb_table_function)>,
    pub duckdb_table_function_set_name: ::std::option::Option<
        unsafe extern "C" fn(table_function: duckdb_table_function, name: *const ::std::os::raw::c_char),
    >,
    pub duckdb_table_function_add_parameter:
        ::std::option::Option<unsafe extern "C" fn(table_function: duckdb_table_function, type_: duckdb_logical_type)>,
    pub duckdb_table_function_add_named_parameter: ::std::option::Option<
        unsafe extern "C" fn(
            table_function: duckdb_table_function,
            name: *const ::std::os::raw::c_char,
            type_: duckdb_logical_type,
        ),
    >,
    pub duckdb_table_function_set_extra_info: ::std::option::Option<
        unsafe extern "C" fn(
            table_function: duckdb_table_function,
            extra_info: *mut ::std::os::raw::c_void,
            destroy: duckdb_delete_callback_t,
        ),
    >,
    pub duckdb_table_function_set_bind: ::std::option::Option<
        unsafe extern "C" fn(table_function: duckdb_table_function, bind: duckdb_table_function_bind_t),
    >,
    pub duckdb_table_function_set_init: ::std::option::Option<
        unsafe extern "C" fn(table_function: duckdb_table_function, init: duckdb_table_function_init_t),
    >,
    pub duckdb_table_function_set_local_init: ::std::option::Option<
        unsafe extern "C" fn(table_function: duckdb_table_function, init: duckdb_table_function_init_t),
    >,
    pub duckdb_table_function_set_function: ::std::option::Option<
        unsafe extern "C" fn(table_function: duckdb_table_function, function: duckdb_table_function_t),
    >,
    pub duckdb_table_function_supports_projection_pushdown:
        ::std::option::Option<unsafe extern "C" fn(table_function: duckdb_table_function, pushdown: bool)>,
    pub duckdb_register_table_function: ::std::option::Option<
        unsafe extern "C" fn(con: duckdb_connection, function: duckdb_table_function) -> duckdb_state,
    >,
    pub duckdb_bind_get_extra_info:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_bind_info) -> *mut ::std::os::raw::c_void>,
    pub duckdb_bind_add_result_column: ::std::option::Option<
        unsafe extern "C" fn(info: duckdb_bind_info, name: *const ::std::os::raw::c_char, type_: duckdb_logical_type),
    >,
    pub duckdb_bind_get_parameter_count: ::std::option::Option<unsafe extern "C" fn(info: duckdb_bind_info) -> idx_t>,
    pub duckdb_bind_get_parameter:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_bind_info, index: idx_t) -> duckdb_value>,
    pub duckdb_bind_get_named_parameter: ::std::option::Option<
        unsafe extern "C" fn(info: duckdb_bind_info, name: *const ::std::os::raw::c_char) -> duckdb_value,
    >,
    pub duckdb_bind_set_bind_data: ::std::option::Option<
        unsafe extern "C" fn(
            info: duckdb_bind_info,
            bind_data: *mut ::std::os::raw::c_void,
            destroy: duckdb_delete_callback_t,
        ),
    >,
    pub duckdb_bind_set_cardinality:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_bind_info, cardinality: idx_t, is_exact: bool)>,
    pub duckdb_bind_set_error:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_bind_info, error: *const ::std::os::raw::c_char)>,
    pub duckdb_init_get_extra_info:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_init_info) -> *mut ::std::os::raw::c_void>,
    pub duckdb_init_get_bind_data:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_init_info) -> *mut ::std::os::raw::c_void>,
    pub duckdb_init_set_init_data: ::std::option::Option<
        unsafe extern "C" fn(
            info: duckdb_init_info,
            init_data: *mut ::std::os::raw::c_void,
            destroy: duckdb_delete_callback_t,
        ),
    >,
    pub duckdb_init_get_column_count: ::std::option::Option<unsafe extern "C" fn(info: duckdb_init_info) -> idx_t>,
    pub duckdb_init_get_column_index:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_init_info, column_index: idx_t) -> idx_t>,
    pub duckdb_init_set_max_threads:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_init_info, max_threads: idx_t)>,
    pub duckdb_init_set_error:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_init_info, error: *const ::std::os::raw::c_char)>,
    pub duckdb_function_get_extra_info:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_function_info) -> *mut ::std::os::raw::c_void>,
    pub duckdb_function_get_bind_data:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_function_info) -> *mut ::std::os::raw::c_void>,
    pub duckdb_function_get_init_data:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_function_info) -> *mut ::std::os::raw::c_void>,
    pub duckdb_function_get_local_init_data:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_function_info) -> *mut ::std::os::raw::c_void>,
    pub duckdb_function_set_error:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_function_info, error: *const ::std::os::raw::c_char)>,
    pub duckdb_add_replacement_scan: ::std::option::Option<
        unsafe extern "C" fn(
            db: duckdb_database,
            replacement: duckdb_replacement_callback_t,
            extra_data: *mut ::std::os::raw::c_void,
            delete_callback: duckdb_delete_callback_t,
        ),
    >,
    pub duckdb_replacement_scan_set_function_name: ::std::option::Option<
        unsafe extern "C" fn(info: duckdb_replacement_scan_info, function_name: *const ::std::os::raw::c_char),
    >,
    pub duckdb_replacement_scan_add_parameter:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_replacement_scan_info, parameter: duckdb_value)>,
    pub duckdb_replacement_scan_set_error: ::std::option::Option<
        unsafe extern "C" fn(info: duckdb_replacement_scan_info, error: *const ::std::os::raw::c_char),
    >,
    pub duckdb_profiling_info_get_metrics:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_profiling_info) -> duckdb_value>,
    pub duckdb_profiling_info_get_child_count:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_profiling_info) -> idx_t>,
    pub duckdb_profiling_info_get_child:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_profiling_info, index: idx_t) -> duckdb_profiling_info>,
    pub duckdb_appender_create: ::std::option::Option<
        unsafe extern "C" fn(
            connection: duckdb_connection,
            schema: *const ::std::os::raw::c_char,
            table: *const ::std::os::raw::c_char,
            out_appender: *mut duckdb_appender,
        ) -> duckdb_state,
    >,
    pub duckdb_appender_create_ext: ::std::option::Option<
        unsafe extern "C" fn(
            connection: duckdb_connection,
            catalog: *const ::std::os::raw::c_char,
            schema: *const ::std::os::raw::c_char,
            table: *const ::std::os::raw::c_char,
            out_appender: *mut duckdb_appender,
        ) -> duckdb_state,
    >,
    pub duckdb_appender_column_count: ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender) -> idx_t>,
    pub duckdb_appender_column_type:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, col_idx: idx_t) -> duckdb_logical_type>,
    pub duckdb_appender_error:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender) -> *const ::std::os::raw::c_char>,
    pub duckdb_appender_flush: ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender) -> duckdb_state>,
    pub duckdb_appender_close: ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender) -> duckdb_state>,
    pub duckdb_appender_destroy:
        ::std::option::Option<unsafe extern "C" fn(appender: *mut duckdb_appender) -> duckdb_state>,
    pub duckdb_appender_add_column: ::std::option::Option<
        unsafe extern "C" fn(appender: duckdb_appender, name: *const ::std::os::raw::c_char) -> duckdb_state,
    >,
    pub duckdb_appender_clear_columns:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender) -> duckdb_state>,
    pub duckdb_append_data_chunk: ::std::option::Option<
        unsafe extern "C" fn(appender: duckdb_appender, chunk: duckdb_data_chunk) -> duckdb_state,
    >,
    pub duckdb_table_description_create: ::std::option::Option<
        unsafe extern "C" fn(
            connection: duckdb_connection,
            schema: *const ::std::os::raw::c_char,
            table: *const ::std::os::raw::c_char,
            out: *mut duckdb_table_description,
        ) -> duckdb_state,
    >,
    pub duckdb_table_description_create_ext: ::std::option::Option<
        unsafe extern "C" fn(
            connection: duckdb_connection,
            catalog: *const ::std::os::raw::c_char,
            schema: *const ::std::os::raw::c_char,
            table: *const ::std::os::raw::c_char,
            out: *mut duckdb_table_description,
        ) -> duckdb_state,
    >,
    pub duckdb_table_description_destroy:
        ::std::option::Option<unsafe extern "C" fn(table_description: *mut duckdb_table_description)>,
    pub duckdb_table_description_error: ::std::option::Option<
        unsafe extern "C" fn(table_description: duckdb_table_description) -> *const ::std::os::raw::c_char,
    >,
    pub duckdb_column_has_default: ::std::option::Option<
        unsafe extern "C" fn(table_description: duckdb_table_description, index: idx_t, out: *mut bool) -> duckdb_state,
    >,
    pub duckdb_table_description_get_column_name: ::std::option::Option<
        unsafe extern "C" fn(table_description: duckdb_table_description, index: idx_t) -> *mut ::std::os::raw::c_char,
    >,
    pub duckdb_execute_tasks: ::std::option::Option<unsafe extern "C" fn(database: duckdb_database, max_tasks: idx_t)>,
    pub duckdb_create_task_state:
        ::std::option::Option<unsafe extern "C" fn(database: duckdb_database) -> duckdb_task_state>,
    pub duckdb_execute_tasks_state: ::std::option::Option<unsafe extern "C" fn(state: duckdb_task_state)>,
    pub duckdb_execute_n_tasks_state:
        ::std::option::Option<unsafe extern "C" fn(state: duckdb_task_state, max_tasks: idx_t) -> idx_t>,
    pub duckdb_finish_execution: ::std::option::Option<unsafe extern "C" fn(state: duckdb_task_state)>,
    pub duckdb_task_state_is_finished: ::std::option::Option<unsafe extern "C" fn(state: duckdb_task_state) -> bool>,
    pub duckdb_destroy_task_state: ::std::option::Option<unsafe extern "C" fn(state: duckdb_task_state)>,
    pub duckdb_execution_is_finished: ::std::option::Option<unsafe extern "C" fn(con: duckdb_connection) -> bool>,
    pub duckdb_fetch_chunk: ::std::option::Option<unsafe extern "C" fn(result: duckdb_result) -> duckdb_data_chunk>,
    pub duckdb_create_cast_function: ::std::option::Option<unsafe extern "C" fn() -> duckdb_cast_function>,
    pub duckdb_cast_function_set_source_type: ::std::option::Option<
        unsafe extern "C" fn(cast_function: duckdb_cast_function, source_type: duckdb_logical_type),
    >,
    pub duckdb_cast_function_set_target_type: ::std::option::Option<
        unsafe extern "C" fn(cast_function: duckdb_cast_function, target_type: duckdb_logical_type),
    >,
    pub duckdb_cast_function_set_implicit_cast_cost:
        ::std::option::Option<unsafe extern "C" fn(cast_function: duckdb_cast_function, cost: i64)>,
    pub duckdb_cast_function_set_function: ::std::option::Option<
        unsafe extern "C" fn(cast_function: duckdb_cast_function, function: duckdb_cast_function_t),
    >,
    pub duckdb_cast_function_set_extra_info: ::std::option::Option<
        unsafe extern "C" fn(
            cast_function: duckdb_cast_function,
            extra_info: *mut ::std::os::raw::c_void,
            destroy: duckdb_delete_callback_t,
        ),
    >,
    pub duckdb_cast_function_get_extra_info:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_function_info) -> *mut ::std::os::raw::c_void>,
    pub duckdb_cast_function_get_cast_mode:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_function_info) -> duckdb_cast_mode>,
    pub duckdb_cast_function_set_error:
        ::std::option::Option<unsafe extern "C" fn(info: duckdb_function_info, error: *const ::std::os::raw::c_char)>,
    pub duckdb_cast_function_set_row_error: ::std::option::Option<
        unsafe extern "C" fn(
            info: duckdb_function_info,
            error: *const ::std::os::raw::c_char,
            row: idx_t,
            output: duckdb_vector,
        ),
    >,
    pub duckdb_register_cast_function: ::std::option::Option<
        unsafe extern "C" fn(con: duckdb_connection, cast_function: duckdb_cast_function) -> duckdb_state,
    >,
    pub duckdb_destroy_cast_function:
        ::std::option::Option<unsafe extern "C" fn(cast_function: *mut duckdb_cast_function)>,
    pub duckdb_is_finite_timestamp_s: ::std::option::Option<unsafe extern "C" fn(ts: duckdb_timestamp_s) -> bool>,
    pub duckdb_is_finite_timestamp_ms: ::std::option::Option<unsafe extern "C" fn(ts: duckdb_timestamp_ms) -> bool>,
    pub duckdb_is_finite_timestamp_ns: ::std::option::Option<unsafe extern "C" fn(ts: duckdb_timestamp_ns) -> bool>,
    pub duckdb_create_timestamp_tz:
        ::std::option::Option<unsafe extern "C" fn(input: duckdb_timestamp) -> duckdb_value>,
    pub duckdb_create_timestamp_s:
        ::std::option::Option<unsafe extern "C" fn(input: duckdb_timestamp_s) -> duckdb_value>,
    pub duckdb_create_timestamp_ms:
        ::std::option::Option<unsafe extern "C" fn(input: duckdb_timestamp_ms) -> duckdb_value>,
    pub duckdb_create_timestamp_ns:
        ::std::option::Option<unsafe extern "C" fn(input: duckdb_timestamp_ns) -> duckdb_value>,
    pub duckdb_get_timestamp_tz: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> duckdb_timestamp>,
    pub duckdb_get_timestamp_s: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> duckdb_timestamp_s>,
    pub duckdb_get_timestamp_ms: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> duckdb_timestamp_ms>,
    pub duckdb_get_timestamp_ns: ::std::option::Option<unsafe extern "C" fn(val: duckdb_value) -> duckdb_timestamp_ns>,
    pub duckdb_append_value:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, value: duckdb_value) -> duckdb_state>,
    pub duckdb_get_profiling_info:
        ::std::option::Option<unsafe extern "C" fn(connection: duckdb_connection) -> duckdb_profiling_info>,
    pub duckdb_profiling_info_get_value: ::std::option::Option<
        unsafe extern "C" fn(info: duckdb_profiling_info, key: *const ::std::os::raw::c_char) -> duckdb_value,
    >,
    pub duckdb_appender_begin_row:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender) -> duckdb_state>,
    pub duckdb_appender_end_row: ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender) -> duckdb_state>,
    pub duckdb_append_default: ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender) -> duckdb_state>,
    pub duckdb_append_bool:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, value: bool) -> duckdb_state>,
    pub duckdb_append_int8:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, value: i8) -> duckdb_state>,
    pub duckdb_append_int16:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, value: i16) -> duckdb_state>,
    pub duckdb_append_int32:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, value: i32) -> duckdb_state>,
    pub duckdb_append_int64:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, value: i64) -> duckdb_state>,
    pub duckdb_append_hugeint:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, value: duckdb_hugeint) -> duckdb_state>,
    pub duckdb_append_uint8:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, value: u8) -> duckdb_state>,
    pub duckdb_append_uint16:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, value: u16) -> duckdb_state>,
    pub duckdb_append_uint32:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, value: u32) -> duckdb_state>,
    pub duckdb_append_uint64:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, value: u64) -> duckdb_state>,
    pub duckdb_append_uhugeint:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, value: duckdb_uhugeint) -> duckdb_state>,
    pub duckdb_append_float:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, value: f32) -> duckdb_state>,
    pub duckdb_append_double:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, value: f64) -> duckdb_state>,
    pub duckdb_append_date:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, value: duckdb_date) -> duckdb_state>,
    pub duckdb_append_time:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, value: duckdb_time) -> duckdb_state>,
    pub duckdb_append_timestamp:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, value: duckdb_timestamp) -> duckdb_state>,
    pub duckdb_append_interval:
        ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender, value: duckdb_interval) -> duckdb_state>,
    pub duckdb_append_varchar: ::std::option::Option<
        unsafe extern "C" fn(appender: duckdb_appender, val: *const ::std::os::raw::c_char) -> duckdb_state,
    >,
    pub duckdb_append_varchar_length: ::std::option::Option<
        unsafe extern "C" fn(
            appender: duckdb_appender,
            val: *const ::std::os::raw::c_char,
            length: idx_t,
        ) -> duckdb_state,
    >,
    pub duckdb_append_blob: ::std::option::Option<
        unsafe extern "C" fn(
            appender: duckdb_appender,
            data: *const ::std::os::raw::c_void,
            length: idx_t,
        ) -> duckdb_state,
    >,
    pub duckdb_append_null: ::std::option::Option<unsafe extern "C" fn(appender: duckdb_appender) -> duckdb_state>,
    pub duckdb_row_count: ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result) -> idx_t>,
    pub duckdb_column_data: ::std::option::Option<
        unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t) -> *mut ::std::os::raw::c_void,
    >,
    pub duckdb_nullmask_data:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t) -> *mut bool>,
    pub duckdb_result_get_chunk:
        ::std::option::Option<unsafe extern "C" fn(result: duckdb_result, chunk_index: idx_t) -> duckdb_data_chunk>,
    pub duckdb_result_is_streaming: ::std::option::Option<unsafe extern "C" fn(result: duckdb_result) -> bool>,
    pub duckdb_result_chunk_count: ::std::option::Option<unsafe extern "C" fn(result: duckdb_result) -> idx_t>,
    pub duckdb_value_boolean:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> bool>,
    pub duckdb_value_int8:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> i8>,
    pub duckdb_value_int16:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> i16>,
    pub duckdb_value_int32:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> i32>,
    pub duckdb_value_int64:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> i64>,
    pub duckdb_value_hugeint: ::std::option::Option<
        unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> duckdb_hugeint,
    >,
    pub duckdb_value_uhugeint: ::std::option::Option<
        unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> duckdb_uhugeint,
    >,
    pub duckdb_value_decimal: ::std::option::Option<
        unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> duckdb_decimal,
    >,
    pub duckdb_value_uint8:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> u8>,
    pub duckdb_value_uint16:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> u16>,
    pub duckdb_value_uint32:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> u32>,
    pub duckdb_value_uint64:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> u64>,
    pub duckdb_value_float:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> f32>,
    pub duckdb_value_double:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> f64>,
    pub duckdb_value_date:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> duckdb_date>,
    pub duckdb_value_time:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> duckdb_time>,
    pub duckdb_value_timestamp: ::std::option::Option<
        unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> duckdb_timestamp,
    >,
    pub duckdb_value_interval: ::std::option::Option<
        unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> duckdb_interval,
    >,
    pub duckdb_value_varchar: ::std::option::Option<
        unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> *mut ::std::os::raw::c_char,
    >,
    pub duckdb_value_string: ::std::option::Option<
        unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> duckdb_string,
    >,
    pub duckdb_value_varchar_internal: ::std::option::Option<
        unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> *mut ::std::os::raw::c_char,
    >,
    pub duckdb_value_string_internal: ::std::option::Option<
        unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> duckdb_string,
    >,
    pub duckdb_value_blob:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> duckdb_blob>,
    pub duckdb_value_is_null:
        ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_result, col: idx_t, row: idx_t) -> bool>,
    pub duckdb_execute_prepared_streaming: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            out_result: *mut duckdb_result,
        ) -> duckdb_state,
    >,
    pub duckdb_pending_prepared_streaming: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            out_result: *mut duckdb_pending_result,
        ) -> duckdb_state,
    >,
    pub duckdb_query_arrow: ::std::option::Option<
        unsafe extern "C" fn(
            connection: duckdb_connection,
            query: *const ::std::os::raw::c_char,
            out_result: *mut duckdb_arrow,
        ) -> duckdb_state,
    >,
    pub duckdb_query_arrow_schema: ::std::option::Option<
        unsafe extern "C" fn(result: duckdb_arrow, out_schema: *mut duckdb_arrow_schema) -> duckdb_state,
    >,
    pub duckdb_prepared_arrow_schema: ::std::option::Option<
        unsafe extern "C" fn(prepared: duckdb_prepared_statement, out_schema: *mut duckdb_arrow_schema) -> duckdb_state,
    >,
    pub duckdb_result_arrow_array: ::std::option::Option<
        unsafe extern "C" fn(result: duckdb_result, chunk: duckdb_data_chunk, out_array: *mut duckdb_arrow_array),
    >,
    pub duckdb_query_arrow_array: ::std::option::Option<
        unsafe extern "C" fn(result: duckdb_arrow, out_array: *mut duckdb_arrow_array) -> duckdb_state,
    >,
    pub duckdb_arrow_column_count: ::std::option::Option<unsafe extern "C" fn(result: duckdb_arrow) -> idx_t>,
    pub duckdb_arrow_row_count: ::std::option::Option<unsafe extern "C" fn(result: duckdb_arrow) -> idx_t>,
    pub duckdb_arrow_rows_changed: ::std::option::Option<unsafe extern "C" fn(result: duckdb_arrow) -> idx_t>,
    pub duckdb_query_arrow_error:
        ::std::option::Option<unsafe extern "C" fn(result: duckdb_arrow) -> *const ::std::os::raw::c_char>,
    pub duckdb_destroy_arrow: ::std::option::Option<unsafe extern "C" fn(result: *mut duckdb_arrow)>,
    pub duckdb_destroy_arrow_stream: ::std::option::Option<unsafe extern "C" fn(stream_p: *mut duckdb_arrow_stream)>,
    pub duckdb_execute_prepared_arrow: ::std::option::Option<
        unsafe extern "C" fn(
            prepared_statement: duckdb_prepared_statement,
            out_result: *mut duckdb_arrow,
        ) -> duckdb_state,
    >,
    pub duckdb_arrow_scan: ::std::option::Option<
        unsafe extern "C" fn(
            connection: duckdb_connection,
            table_name: *const ::std::os::raw::c_char,
            arrow: duckdb_arrow_stream,
        ) -> duckdb_state,
    >,
    pub duckdb_arrow_array_scan: ::std::option::Option<
        unsafe extern "C" fn(
            connection: duckdb_connection,
            table_name: *const ::std::os::raw::c_char,
            arrow_schema: duckdb_arrow_schema,
            arrow_array: duckdb_arrow_array,
            out_stream: *mut duckdb_arrow_stream,
        ) -> duckdb_state,
    >,
    pub duckdb_stream_fetch_chunk:
        ::std::option::Option<unsafe extern "C" fn(result: duckdb_result) -> duckdb_data_chunk>,
    pub duckdb_create_instance_cache: ::std::option::Option<unsafe extern "C" fn() -> duckdb_instance_cache>,
    pub duckdb_get_or_create_from_cache: ::std::option::Option<
        unsafe extern "C" fn(
            instance_cache: duckdb_instance_cache,
            path: *const ::std::os::raw::c_char,
            out_database: *mut duckdb_database,
            config: duckdb_config,
            out_error: *mut *mut ::std::os::raw::c_char,
        ) -> duckdb_state,
    >,
    pub duckdb_destroy_instance_cache:
        ::std::option::Option<unsafe extern "C" fn(instance_cache: *mut duckdb_instance_cache)>,
    pub duckdb_append_default_to_chunk: ::std::option::Option<
        unsafe extern "C" fn(
            appender: duckdb_appender,
            chunk: duckdb_data_chunk,
            col: idx_t,
            row: idx_t,
        ) -> duckdb_state,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of duckdb_ext_api_v1"][::std::mem::size_of::<duckdb_ext_api_v1>() - 3264usize];
    ["Alignment of duckdb_ext_api_v1"][::std::mem::align_of::<duckdb_ext_api_v1>() - 8usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_open"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_open) - 0usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_open_ext"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_open_ext) - 8usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_close"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_close) - 16usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_connect"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_connect) - 24usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_interrupt"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_interrupt) - 32usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_query_progress"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_query_progress) - 40usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_disconnect"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_disconnect) - 48usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_library_version"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_library_version) - 56usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_config"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_config) - 64usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_config_count"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_config_count) - 72usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_config_flag"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_config_flag) - 80usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_set_config"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_set_config) - 88usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_destroy_config"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_destroy_config) - 96usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_query"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_query) - 104usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_destroy_result"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_destroy_result) - 112usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_column_name"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_column_name) - 120usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_column_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_column_type) - 128usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_result_statement_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_result_statement_type) - 136usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_column_logical_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_column_logical_type) - 144usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_column_count"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_column_count) - 152usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_rows_changed"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_rows_changed) - 160usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_result_error"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_result_error) - 168usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_result_error_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_result_error_type) - 176usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_result_return_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_result_return_type) - 184usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_malloc"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_malloc) - 192usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_free"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_free) - 200usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_vector_size"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_vector_size) - 208usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_string_is_inlined"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_string_is_inlined) - 216usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_string_t_length"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_string_t_length) - 224usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_string_t_data"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_string_t_data) - 232usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_from_date"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_from_date) - 240usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_to_date"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_to_date) - 248usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_is_finite_date"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_is_finite_date) - 256usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_from_time"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_from_time) - 264usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_time_tz"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_time_tz) - 272usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_from_time_tz"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_from_time_tz) - 280usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_to_time"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_to_time) - 288usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_from_timestamp"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_from_timestamp) - 296usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_to_timestamp"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_to_timestamp) - 304usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_is_finite_timestamp"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_is_finite_timestamp) - 312usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_hugeint_to_double"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_hugeint_to_double) - 320usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_double_to_hugeint"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_double_to_hugeint) - 328usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_uhugeint_to_double"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_uhugeint_to_double) - 336usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_double_to_uhugeint"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_double_to_uhugeint) - 344usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_double_to_decimal"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_double_to_decimal) - 352usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_decimal_to_double"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_decimal_to_double) - 360usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_prepare"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_prepare) - 368usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_destroy_prepare"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_destroy_prepare) - 376usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_prepare_error"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_prepare_error) - 384usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_nparams"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_nparams) - 392usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_parameter_name"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_parameter_name) - 400usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_param_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_param_type) - 408usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_param_logical_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_param_logical_type) - 416usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_clear_bindings"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_clear_bindings) - 424usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_prepared_statement_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_prepared_statement_type) - 432usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_value"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_value) - 440usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_parameter_index"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_parameter_index) - 448usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_boolean"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_boolean) - 456usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_int8"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_int8) - 464usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_int16"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_int16) - 472usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_int32"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_int32) - 480usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_int64"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_int64) - 488usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_hugeint"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_hugeint) - 496usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_uhugeint"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_uhugeint) - 504usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_decimal"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_decimal) - 512usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_uint8"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_uint8) - 520usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_uint16"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_uint16) - 528usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_uint32"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_uint32) - 536usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_uint64"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_uint64) - 544usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_float"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_float) - 552usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_double"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_double) - 560usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_date"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_date) - 568usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_time"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_time) - 576usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_timestamp"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_timestamp) - 584usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_timestamp_tz"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_timestamp_tz) - 592usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_interval"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_interval) - 600usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_varchar"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_varchar) - 608usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_varchar_length"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_varchar_length) - 616usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_blob"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_blob) - 624usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_null"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_null) - 632usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_execute_prepared"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_execute_prepared) - 640usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_extract_statements"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_extract_statements) - 648usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_prepare_extracted_statement"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_prepare_extracted_statement) - 656usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_extract_statements_error"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_extract_statements_error) - 664usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_destroy_extracted"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_destroy_extracted) - 672usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_pending_prepared"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_pending_prepared) - 680usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_destroy_pending"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_destroy_pending) - 688usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_pending_error"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_pending_error) - 696usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_pending_execute_task"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_pending_execute_task) - 704usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_pending_execute_check_state"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_pending_execute_check_state) - 712usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_execute_pending"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_execute_pending) - 720usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_pending_execution_is_finished"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_pending_execution_is_finished) - 728usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_destroy_value"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_destroy_value) - 736usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_varchar"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_varchar) - 744usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_varchar_length"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_varchar_length) - 752usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_bool"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_bool) - 760usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_int8"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_int8) - 768usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_uint8"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_uint8) - 776usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_int16"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_int16) - 784usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_uint16"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_uint16) - 792usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_int32"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_int32) - 800usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_uint32"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_uint32) - 808usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_uint64"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_uint64) - 816usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_int64"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_int64) - 824usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_hugeint"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_hugeint) - 832usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_uhugeint"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_uhugeint) - 840usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_float"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_float) - 848usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_double"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_double) - 856usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_date"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_date) - 864usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_time"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_time) - 872usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_time_tz_value"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_time_tz_value) - 880usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_timestamp"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_timestamp) - 888usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_interval"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_interval) - 896usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_blob"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_blob) - 904usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_varint"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_varint) - 912usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_decimal"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_decimal) - 920usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_bit"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_bit) - 928usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_uuid"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_uuid) - 936usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_bool"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_bool) - 944usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_int8"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_int8) - 952usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_uint8"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_uint8) - 960usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_int16"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_int16) - 968usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_uint16"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_uint16) - 976usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_int32"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_int32) - 984usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_uint32"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_uint32) - 992usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_int64"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_int64) - 1000usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_uint64"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_uint64) - 1008usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_hugeint"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_hugeint) - 1016usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_uhugeint"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_uhugeint) - 1024usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_float"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_float) - 1032usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_double"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_double) - 1040usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_date"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_date) - 1048usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_time"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_time) - 1056usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_time_tz"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_time_tz) - 1064usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_timestamp"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_timestamp) - 1072usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_interval"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_interval) - 1080usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_value_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_value_type) - 1088usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_blob"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_blob) - 1096usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_varint"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_varint) - 1104usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_decimal"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_decimal) - 1112usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_bit"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_bit) - 1120usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_uuid"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_uuid) - 1128usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_varchar"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_varchar) - 1136usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_struct_value"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_struct_value) - 1144usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_list_value"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_list_value) - 1152usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_array_value"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_array_value) - 1160usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_map_size"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_map_size) - 1168usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_map_key"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_map_key) - 1176usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_map_value"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_map_value) - 1184usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_is_null_value"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_is_null_value) - 1192usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_null_value"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_null_value) - 1200usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_list_size"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_list_size) - 1208usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_list_child"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_list_child) - 1216usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_enum_value"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_enum_value) - 1224usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_enum_value"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_enum_value) - 1232usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_struct_child"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_struct_child) - 1240usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_logical_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_logical_type) - 1248usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_logical_type_get_alias"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_logical_type_get_alias) - 1256usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_logical_type_set_alias"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_logical_type_set_alias) - 1264usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_list_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_list_type) - 1272usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_array_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_array_type) - 1280usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_map_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_map_type) - 1288usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_union_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_union_type) - 1296usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_struct_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_struct_type) - 1304usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_enum_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_enum_type) - 1312usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_decimal_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_decimal_type) - 1320usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_type_id"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_type_id) - 1328usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_decimal_width"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_decimal_width) - 1336usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_decimal_scale"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_decimal_scale) - 1344usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_decimal_internal_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_decimal_internal_type) - 1352usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_enum_internal_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_enum_internal_type) - 1360usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_enum_dictionary_size"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_enum_dictionary_size) - 1368usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_enum_dictionary_value"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_enum_dictionary_value) - 1376usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_list_type_child_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_list_type_child_type) - 1384usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_array_type_child_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_array_type_child_type) - 1392usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_array_type_array_size"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_array_type_array_size) - 1400usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_map_type_key_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_map_type_key_type) - 1408usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_map_type_value_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_map_type_value_type) - 1416usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_struct_type_child_count"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_struct_type_child_count) - 1424usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_struct_type_child_name"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_struct_type_child_name) - 1432usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_struct_type_child_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_struct_type_child_type) - 1440usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_union_type_member_count"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_union_type_member_count) - 1448usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_union_type_member_name"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_union_type_member_name) - 1456usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_union_type_member_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_union_type_member_type) - 1464usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_destroy_logical_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_destroy_logical_type) - 1472usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_register_logical_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_register_logical_type) - 1480usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_data_chunk"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_data_chunk) - 1488usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_destroy_data_chunk"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_destroy_data_chunk) - 1496usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_data_chunk_reset"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_data_chunk_reset) - 1504usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_data_chunk_get_column_count"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_data_chunk_get_column_count) - 1512usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_data_chunk_get_vector"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_data_chunk_get_vector) - 1520usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_data_chunk_get_size"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_data_chunk_get_size) - 1528usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_data_chunk_set_size"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_data_chunk_set_size) - 1536usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_vector_get_column_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_vector_get_column_type) - 1544usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_vector_get_data"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_vector_get_data) - 1552usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_vector_get_validity"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_vector_get_validity) - 1560usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_vector_ensure_validity_writable"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_vector_ensure_validity_writable) - 1568usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_vector_assign_string_element"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_vector_assign_string_element) - 1576usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_vector_assign_string_element_len"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_vector_assign_string_element_len) - 1584usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_list_vector_get_child"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_list_vector_get_child) - 1592usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_list_vector_get_size"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_list_vector_get_size) - 1600usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_list_vector_set_size"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_list_vector_set_size) - 1608usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_list_vector_reserve"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_list_vector_reserve) - 1616usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_struct_vector_get_child"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_struct_vector_get_child) - 1624usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_array_vector_get_child"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_array_vector_get_child) - 1632usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_validity_row_is_valid"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_validity_row_is_valid) - 1640usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_validity_set_row_validity"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_validity_set_row_validity) - 1648usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_validity_set_row_invalid"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_validity_set_row_invalid) - 1656usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_validity_set_row_valid"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_validity_set_row_valid) - 1664usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_scalar_function"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_scalar_function) - 1672usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_destroy_scalar_function"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_destroy_scalar_function) - 1680usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_scalar_function_set_name"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_scalar_function_set_name) - 1688usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_scalar_function_set_varargs"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_scalar_function_set_varargs) - 1696usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_scalar_function_set_special_handling"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_scalar_function_set_special_handling) - 1704usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_scalar_function_set_volatile"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_scalar_function_set_volatile) - 1712usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_scalar_function_add_parameter"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_scalar_function_add_parameter) - 1720usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_scalar_function_set_return_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_scalar_function_set_return_type) - 1728usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_scalar_function_set_extra_info"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_scalar_function_set_extra_info) - 1736usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_scalar_function_set_function"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_scalar_function_set_function) - 1744usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_register_scalar_function"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_register_scalar_function) - 1752usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_scalar_function_get_extra_info"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_scalar_function_get_extra_info) - 1760usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_scalar_function_set_error"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_scalar_function_set_error) - 1768usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_scalar_function_set"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_scalar_function_set) - 1776usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_destroy_scalar_function_set"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_destroy_scalar_function_set) - 1784usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_add_scalar_function_to_set"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_add_scalar_function_to_set) - 1792usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_register_scalar_function_set"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_register_scalar_function_set) - 1800usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_aggregate_function"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_aggregate_function) - 1808usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_destroy_aggregate_function"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_destroy_aggregate_function) - 1816usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_aggregate_function_set_name"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_aggregate_function_set_name) - 1824usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_aggregate_function_add_parameter"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_aggregate_function_add_parameter) - 1832usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_aggregate_function_set_return_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_aggregate_function_set_return_type) - 1840usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_aggregate_function_set_functions"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_aggregate_function_set_functions) - 1848usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_aggregate_function_set_destructor"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_aggregate_function_set_destructor) - 1856usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_register_aggregate_function"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_register_aggregate_function) - 1864usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_aggregate_function_set_special_handling"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_aggregate_function_set_special_handling) - 1872usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_aggregate_function_set_extra_info"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_aggregate_function_set_extra_info) - 1880usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_aggregate_function_get_extra_info"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_aggregate_function_get_extra_info) - 1888usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_aggregate_function_set_error"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_aggregate_function_set_error) - 1896usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_aggregate_function_set"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_aggregate_function_set) - 1904usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_destroy_aggregate_function_set"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_destroy_aggregate_function_set) - 1912usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_add_aggregate_function_to_set"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_add_aggregate_function_to_set) - 1920usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_register_aggregate_function_set"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_register_aggregate_function_set) - 1928usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_table_function"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_table_function) - 1936usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_destroy_table_function"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_destroy_table_function) - 1944usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_table_function_set_name"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_table_function_set_name) - 1952usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_table_function_add_parameter"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_table_function_add_parameter) - 1960usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_table_function_add_named_parameter"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_table_function_add_named_parameter) - 1968usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_table_function_set_extra_info"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_table_function_set_extra_info) - 1976usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_table_function_set_bind"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_table_function_set_bind) - 1984usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_table_function_set_init"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_table_function_set_init) - 1992usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_table_function_set_local_init"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_table_function_set_local_init) - 2000usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_table_function_set_function"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_table_function_set_function) - 2008usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_table_function_supports_projection_pushdown"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_table_function_supports_projection_pushdown) - 2016usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_register_table_function"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_register_table_function) - 2024usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_get_extra_info"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_get_extra_info) - 2032usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_add_result_column"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_add_result_column) - 2040usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_get_parameter_count"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_get_parameter_count) - 2048usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_get_parameter"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_get_parameter) - 2056usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_get_named_parameter"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_get_named_parameter) - 2064usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_set_bind_data"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_set_bind_data) - 2072usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_set_cardinality"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_set_cardinality) - 2080usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_bind_set_error"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_bind_set_error) - 2088usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_init_get_extra_info"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_init_get_extra_info) - 2096usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_init_get_bind_data"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_init_get_bind_data) - 2104usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_init_set_init_data"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_init_set_init_data) - 2112usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_init_get_column_count"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_init_get_column_count) - 2120usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_init_get_column_index"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_init_get_column_index) - 2128usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_init_set_max_threads"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_init_set_max_threads) - 2136usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_init_set_error"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_init_set_error) - 2144usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_function_get_extra_info"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_function_get_extra_info) - 2152usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_function_get_bind_data"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_function_get_bind_data) - 2160usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_function_get_init_data"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_function_get_init_data) - 2168usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_function_get_local_init_data"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_function_get_local_init_data) - 2176usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_function_set_error"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_function_set_error) - 2184usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_add_replacement_scan"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_add_replacement_scan) - 2192usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_replacement_scan_set_function_name"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_replacement_scan_set_function_name) - 2200usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_replacement_scan_add_parameter"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_replacement_scan_add_parameter) - 2208usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_replacement_scan_set_error"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_replacement_scan_set_error) - 2216usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_profiling_info_get_metrics"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_profiling_info_get_metrics) - 2224usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_profiling_info_get_child_count"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_profiling_info_get_child_count) - 2232usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_profiling_info_get_child"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_profiling_info_get_child) - 2240usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_appender_create"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_appender_create) - 2248usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_appender_create_ext"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_appender_create_ext) - 2256usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_appender_column_count"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_appender_column_count) - 2264usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_appender_column_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_appender_column_type) - 2272usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_appender_error"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_appender_error) - 2280usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_appender_flush"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_appender_flush) - 2288usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_appender_close"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_appender_close) - 2296usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_appender_destroy"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_appender_destroy) - 2304usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_appender_add_column"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_appender_add_column) - 2312usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_appender_clear_columns"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_appender_clear_columns) - 2320usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_data_chunk"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_data_chunk) - 2328usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_table_description_create"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_table_description_create) - 2336usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_table_description_create_ext"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_table_description_create_ext) - 2344usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_table_description_destroy"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_table_description_destroy) - 2352usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_table_description_error"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_table_description_error) - 2360usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_column_has_default"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_column_has_default) - 2368usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_table_description_get_column_name"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_table_description_get_column_name) - 2376usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_execute_tasks"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_execute_tasks) - 2384usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_task_state"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_task_state) - 2392usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_execute_tasks_state"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_execute_tasks_state) - 2400usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_execute_n_tasks_state"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_execute_n_tasks_state) - 2408usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_finish_execution"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_finish_execution) - 2416usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_task_state_is_finished"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_task_state_is_finished) - 2424usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_destroy_task_state"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_destroy_task_state) - 2432usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_execution_is_finished"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_execution_is_finished) - 2440usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_fetch_chunk"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_fetch_chunk) - 2448usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_cast_function"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_cast_function) - 2456usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_cast_function_set_source_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_cast_function_set_source_type) - 2464usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_cast_function_set_target_type"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_cast_function_set_target_type) - 2472usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_cast_function_set_implicit_cast_cost"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_cast_function_set_implicit_cast_cost) - 2480usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_cast_function_set_function"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_cast_function_set_function) - 2488usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_cast_function_set_extra_info"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_cast_function_set_extra_info) - 2496usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_cast_function_get_extra_info"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_cast_function_get_extra_info) - 2504usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_cast_function_get_cast_mode"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_cast_function_get_cast_mode) - 2512usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_cast_function_set_error"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_cast_function_set_error) - 2520usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_cast_function_set_row_error"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_cast_function_set_row_error) - 2528usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_register_cast_function"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_register_cast_function) - 2536usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_destroy_cast_function"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_destroy_cast_function) - 2544usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_is_finite_timestamp_s"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_is_finite_timestamp_s) - 2552usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_is_finite_timestamp_ms"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_is_finite_timestamp_ms) - 2560usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_is_finite_timestamp_ns"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_is_finite_timestamp_ns) - 2568usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_timestamp_tz"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_timestamp_tz) - 2576usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_timestamp_s"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_timestamp_s) - 2584usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_timestamp_ms"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_timestamp_ms) - 2592usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_timestamp_ns"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_timestamp_ns) - 2600usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_timestamp_tz"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_timestamp_tz) - 2608usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_timestamp_s"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_timestamp_s) - 2616usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_timestamp_ms"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_timestamp_ms) - 2624usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_timestamp_ns"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_timestamp_ns) - 2632usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_value"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_value) - 2640usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_profiling_info"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_profiling_info) - 2648usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_profiling_info_get_value"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_profiling_info_get_value) - 2656usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_appender_begin_row"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_appender_begin_row) - 2664usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_appender_end_row"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_appender_end_row) - 2672usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_default"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_default) - 2680usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_bool"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_bool) - 2688usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_int8"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_int8) - 2696usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_int16"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_int16) - 2704usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_int32"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_int32) - 2712usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_int64"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_int64) - 2720usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_hugeint"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_hugeint) - 2728usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_uint8"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_uint8) - 2736usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_uint16"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_uint16) - 2744usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_uint32"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_uint32) - 2752usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_uint64"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_uint64) - 2760usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_uhugeint"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_uhugeint) - 2768usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_float"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_float) - 2776usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_double"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_double) - 2784usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_date"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_date) - 2792usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_time"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_time) - 2800usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_timestamp"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_timestamp) - 2808usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_interval"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_interval) - 2816usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_varchar"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_varchar) - 2824usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_varchar_length"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_varchar_length) - 2832usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_blob"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_blob) - 2840usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_null"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_null) - 2848usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_row_count"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_row_count) - 2856usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_column_data"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_column_data) - 2864usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_nullmask_data"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_nullmask_data) - 2872usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_result_get_chunk"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_result_get_chunk) - 2880usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_result_is_streaming"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_result_is_streaming) - 2888usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_result_chunk_count"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_result_chunk_count) - 2896usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_boolean"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_boolean) - 2904usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_int8"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_int8) - 2912usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_int16"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_int16) - 2920usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_int32"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_int32) - 2928usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_int64"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_int64) - 2936usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_hugeint"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_hugeint) - 2944usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_uhugeint"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_uhugeint) - 2952usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_decimal"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_decimal) - 2960usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_uint8"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_uint8) - 2968usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_uint16"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_uint16) - 2976usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_uint32"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_uint32) - 2984usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_uint64"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_uint64) - 2992usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_float"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_float) - 3000usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_double"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_double) - 3008usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_date"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_date) - 3016usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_time"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_time) - 3024usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_timestamp"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_timestamp) - 3032usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_interval"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_interval) - 3040usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_varchar"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_varchar) - 3048usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_string"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_string) - 3056usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_varchar_internal"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_varchar_internal) - 3064usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_string_internal"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_string_internal) - 3072usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_blob"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_blob) - 3080usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_value_is_null"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_value_is_null) - 3088usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_execute_prepared_streaming"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_execute_prepared_streaming) - 3096usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_pending_prepared_streaming"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_pending_prepared_streaming) - 3104usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_query_arrow"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_query_arrow) - 3112usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_query_arrow_schema"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_query_arrow_schema) - 3120usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_prepared_arrow_schema"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_prepared_arrow_schema) - 3128usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_result_arrow_array"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_result_arrow_array) - 3136usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_query_arrow_array"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_query_arrow_array) - 3144usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_arrow_column_count"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_arrow_column_count) - 3152usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_arrow_row_count"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_arrow_row_count) - 3160usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_arrow_rows_changed"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_arrow_rows_changed) - 3168usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_query_arrow_error"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_query_arrow_error) - 3176usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_destroy_arrow"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_destroy_arrow) - 3184usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_destroy_arrow_stream"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_destroy_arrow_stream) - 3192usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_execute_prepared_arrow"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_execute_prepared_arrow) - 3200usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_arrow_scan"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_arrow_scan) - 3208usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_arrow_array_scan"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_arrow_array_scan) - 3216usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_stream_fetch_chunk"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_stream_fetch_chunk) - 3224usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_create_instance_cache"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_create_instance_cache) - 3232usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_get_or_create_from_cache"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_get_or_create_from_cache) - 3240usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_destroy_instance_cache"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_destroy_instance_cache) - 3248usize];
    ["Offset of field: duckdb_ext_api_v1::duckdb_append_default_to_chunk"]
        [::std::mem::offset_of!(duckdb_ext_api_v1, duckdb_append_default_to_chunk) - 3256usize];
};
static __DUCKDB_OPEN: ::std::sync::atomic::AtomicPtr<()> = ::std::sync::atomic::AtomicPtr::new(
    ::std::ptr::null_mut(),
);
pub unsafe fn duckdb_open(
    path: *const ::std::os::raw::c_char,
    out_database: *mut duckdb_database,
) -> duckdb_state {
    let function_ptr = __DUCKDB_OPEN.load(::std::sync::atomic::Ordering::Acquire);
    assert!(
        ! function_ptr.is_null(), "DuckDB API not initialized or DuckDB feature omitted"
    );
    let fun: unsafe extern "C" fn(
        path: *const ::std::os::raw::c_char,
        out_database: *mut duckdb_database,
    ) -> duckdb_state = ::std::mem::transmute(function_ptr);
    (fun)(path, out_database)
}

static __DUCKDB_OPEN_EXT: ::std::sync::atomic::AtomicPtr<()> = ::std::sync::atomic::AtomicPtr::new(
    ::std::ptr::null_mut(),
);
pub unsafe fn duckdb_open_ext(
